<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML><HEAD><TITLE>&#31532; 11 &#31456; &#20107;&#21153;&#21644;&#24182;&#21457;</TITLE>
<META content="text/html; charset=ISO-8859-1" http-equiv=Content-Type><LINK 
rel=stylesheet type=text/css href="../shared/css/html.css">
<META name=GENERATOR content="MSHTML 11.00.9431.193"><LINK 
title="HIBERNATE - &#31526;&#21512;Java&#20064;&#24815;&#30340;&#20851;&#31995;&#25968;&#25454;&#24211;&#25345;&#20037;&#21270;" rel=home href="index.html"><LINK 
title="HIBERNATE - &#31526;&#21512;Java&#20064;&#24815;&#30340;&#20851;&#31995;&#25968;&#25454;&#24211;&#25345;&#20037;&#21270;" rel=up href="index.html"><LINK 
title=&#31532;&nbsp;10&nbsp;&#31456;&nbsp;&#19982;&#23545;&#35937;&#20849;&#20107; rel=previous href="objectstate.html"><LINK 
title="&#31532;&nbsp;12&nbsp;&#31456;&nbsp;&#10;&#9;&#25318;&#25130;&#22120;&#19982;&#20107;&#20214;(Interceptors and events)&#10;&#9;" 
rel=next href="events.html"></HEAD>
<BODY aLink=#0000ff link=#0000ff bgColor=white text=black vLink=#840084>
<DIV class=navheader>
<TABLE width="100%" summary="Navigation header">
  <TBODY>
  <TR>
    <TH colSpan=3 align=center>&#31532;&nbsp;11&nbsp;&#31456;&nbsp;&#20107;&#21153;&#21644;&#24182;&#21457;</TH></TR>
  <TR>
    <TD width="20%" align=left><A accessKey=p 
    href="objectstate.html">&#19978;&#19968;&#39029;</A>&nbsp;</TD>
    <TH width="60%" align=center>&nbsp;</TH>
    <TD width="20%" align=right>&nbsp;<A accessKey=n 
    href="events.html">&#19979;&#19968;&#39029;</A></TD></TR></TBODY></TABLE>
<HR>
</DIV>
<DIV lang=zh-cn class=chapter>
<DIV class=titlepage>
<DIV>
<DIV>
<H2 class=title><A name=transactions></A>&#31532;&nbsp;11&nbsp;&#31456;&nbsp;&#20107;&#21153;&#21644;&#24182;&#21457;</H2>
<P class=title>&#23398;&#20064;<FONT color=#ff0000>QQ&#32676;&#65306;</FONT><FONT color=#ff0000 
size=5>476133513&nbsp;&nbsp; &#21487;&#20197;&#21152;&#32676;&#19968;&#36215;&#35752;&#35770;&#23398;&#20064;</FONT></P></DIV></DIV>
<DIV></DIV></DIV>
<P>Hibernate&#30340;&#20107;&#21153;&#21644;&#24182;&#21457;&#25511;&#21046;&#24456;&#23481;&#26131;&#25484;&#25569;&#12290;Hibernate&#30452;&#25509;&#20351;&#29992;JDBC&#36830;&#25509;&#21644;JTA&#36164;&#28304;&#65292;&#19981;&#28155;&#21152;&#20219;&#20309;&#38468;&#21152;&#38145;&#23450; 
&#34892;&#20026;&#12290;&#25105;&#20204;&#24378;&#28872;&#25512;&#33616;&#20320;&#33457;&#28857;&#26102;&#38388;&#20102;&#35299;JDBC&#32534;&#31243;&#65292;ANSI SQL&#26597;&#35810;&#35821;&#35328;&#21644;&#20320;&#20351;&#29992; &#30340;&#25968;&#25454;&#24211;&#31995;&#32479;&#30340;&#20107;&#21153;&#38548;&#31163;&#35268;&#33539;&#12290; </P>
<P>Hibernate&#19981;&#38145;&#23450;&#20869;&#23384;&#20013;&#30340;&#23545;&#35937;&#12290;&#20320;&#30340;&#24212;&#29992;&#31243;&#24207;&#20250;&#25353;&#29031;&#20320;&#30340;&#25968;&#25454;&#24211;&#20107;&#21153;&#30340;&#38548;&#31163;&#32423;&#21035;&#35268;&#23450;&#30340;&#37027;&#26679;&#36816;&#20316;&#12290;&#24184;&#20111;&#26377;&#20102;<TT 
class=literal>Session</TT>&#65292;&#20351;&#24471;Hibernate&#36890;&#36807;&#26631;&#35782;&#31526;&#26597;&#25214;&#65292;&#21644;&#23454;&#20307;&#26597;&#35810;&#65288;&#19981;&#26159;&#36820;&#22238;&#26631;&#37327;&#20540;&#30340;&#25253;&#34920;&#26597;&#35810;&#65289;&#25552;&#20379;&#20102;&#21487;&#37325;&#22797;&#30340;&#35835;&#21462;&#65288;Repeatable 
reads&#65289;&#21151;&#33021;&#65292;<TT class=literal>Session</TT>&#21516;&#26102;&#20063;&#26159;&#20107;&#21153;&#33539;&#22260;&#20869;&#30340;&#32531;&#23384;&#65288;cache&#65289;&#12290; </P>
<P>&#38500;&#20102;&#23545;&#33258;&#21160;&#20048;&#35266;&#24182;&#21457;&#25511;&#21046;&#25552;&#20379;&#29256;&#26412;&#31649;&#29702;&#65292;&#38024;&#23545;&#34892;&#32423;&#24754;&#35266;&#38145;&#23450;&#65292;Hibernate&#20063;&#25552;&#20379;&#20102;&#36741;&#21161;&#30340;&#65288;&#36739;&#23567;&#30340;)API&#65292;&#23427;&#20351;&#29992;&#20102; <TT 
class=literal>SELECT FOR UPDATE</TT>&#30340;SQL&#35821;&#27861;&#12290;&#26412;&#31456;&#21518;&#38754;&#20250;&#35752;&#35770;&#20048;&#35266;&#24182;&#21457;&#25511;&#21046;&#21644;&#36825;&#20010;API&#12290; </P>
<P>&#25105;&#20204;&#20174;<TT class=literal>Configuration</TT>&#23618;&#12289;<TT 
class=literal>SessionFactory</TT>&#23618;, &#21644; <TT 
class=literal>Session</TT>&#23618;&#24320;&#22987;&#35752;&#35770;Hibernate&#30340;&#24182;&#34892;&#25511;&#21046;&#12289;&#25968;&#25454;&#24211;&#20107;&#21153;&#21644;&#24212;&#29992; &#31243;&#24207;&#30340;&#38271;&#20107;&#21153;&#12290; </P>
<DIV lang=zh-cn class=sect1>
<DIV class=titlepage>
<DIV>
<DIV>
<H2 class=title style="CLEAR: both"><A 
name=transactions-basics></A>11.1.&nbsp;Session&#21644;&#20107;&#21153;&#33539;&#22260;(transaction 
scope)</H2></DIV></DIV>
<DIV></DIV></DIV>
<P><TT 
class=literal>SessionFactory</TT>&#23545;&#35937;&#30340;&#21019;&#24314;&#20195;&#20215;&#24456;&#26114;&#36149;&#65292;&#23427;&#26159;&#32447;&#31243;&#23433;&#20840;&#30340;&#23545;&#35937;&#65292;&#23427;&#20026;&#25152;&#26377;&#30340;&#24212;&#29992;&#31243;&#24207;&#32447;&#31243;&#25152;&#20849;&#20139;&#12290;&#23427;&#21482;&#21019;&#24314;&#19968;&#27425;&#65292;&#36890;&#24120;&#26159;&#22312;&#24212;&#29992;&#31243;&#24207;&#21551;&#21160;&#30340;&#26102;&#20505;&#65292;&#30001;&#19968;&#20010;<TT 
class=literal>Configuraion</TT>&#30340;&#23454;&#20363;&#26469;&#21019;&#24314;&#12290; </P>
<P><TT class=literal>Session</TT>&#23545;&#35937;&#30340;&#21019;&#24314;&#20195;&#20215;&#27604;&#36739;&#23567;&#65292;&#26159;&#38750;&#32447;&#31243;&#23433;&#20840;&#30340;&#65292;&#23545;&#20110;&#21333;&#20010;&#35831;&#27714;&#65292;&#21333;&#20010;&#20250;&#35805;&#12289;&#21333;&#20010;&#30340; 
&#24037;&#20316;&#21333;&#20803;&#32780;&#35328;&#65292;&#23427;&#21482;&#34987;&#20351;&#29992;&#19968;&#27425;&#65292;&#28982;&#21518;&#23601;&#20002;&#24323;&#12290;&#21482;&#26377;&#22312;&#38656;&#35201;&#30340;&#26102;&#20505;&#65292;&#19968;&#20010;<TT class=literal>Session</TT>&#23545;&#35937; &#25165;&#20250;&#33719;&#21462;&#19968;&#20010;JDBC&#30340;<TT 
class=literal>Connection</TT>&#65288;&#25110;&#19968;&#20010;<TT class=literal>Datasource</TT>&#65289; 
&#23545;&#35937;&#65292;&#22240;&#27492;&#20551;&#33509;&#19981;&#20351;&#29992;&#30340;&#26102;&#20505;&#23427;&#19981;&#28040;&#36153;&#20219;&#20309;&#36164;&#28304;&#12290; </P>
<P>&#27492;&#22806;&#25105;&#20204;&#36824;&#35201;&#32771;&#34385;&#25968;&#25454;&#24211;&#20107;&#21153;&#12290;&#25968;&#25454;&#24211;&#20107;&#21153;&#24212;&#35813;&#23613;&#21487;&#33021;&#30340;&#30701;&#65292;&#38477;&#20302;&#25968;&#25454;&#24211;&#20013;&#30340;&#38145;&#20105;&#29992;&#12290; 
&#25968;&#25454;&#24211;&#38271;&#20107;&#21153;&#20250;&#38459;&#27490;&#20320;&#30340;&#24212;&#29992;&#31243;&#24207;&#25193;&#23637;&#21040;&#39640;&#30340;&#24182;&#21457;&#36127;&#36733;&#12290;&#22240;&#27492;&#65292;&#20551;&#33509;&#22312;&#29992;&#25143;&#24605;&#32771;&#26399;&#38388;&#35753;&#25968;&#25454;&#24211;&#20107;&#21153;&#24320;&#30528;&#65292;&#30452;&#21040;&#25972;&#20010;&#24037;&#20316;&#21333;&#20803;&#23436;&#25104;&#25165;&#20851;&#38381;&#36825;&#20010;&#20107;&#21153;&#65292;&#36825;&#32477;&#19981;&#26159;&#19968;&#20010;&#22909;&#30340;&#35774;&#35745;&#12290; </P>
<P>&#19968;&#20010;&#25805;&#20316;&#21333;&#20803;(Unit of work)&#30340;&#33539;&#22260;&#26159;&#22810;&#22823;&#65311;&#21333;&#20010;&#30340;Hibernate <TT class=literal>Session</TT>&#33021;&#36328;&#36234;&#22810;&#20010; 
&#25968;&#25454;&#24211;&#20107;&#21153;&#21527;&#65311;&#36824;&#26159;&#19968;&#20010;<TT class=literal>Session</TT>&#30340;&#20316;&#29992;&#33539;&#22260;&#23545;&#24212;&#19968;&#20010;&#25968;&#25454;&#24211;&#20107;&#21153;&#30340;&#33539;&#22260;&#65311;&#24212;&#35813;&#20309;&#26102;&#25171;&#24320; <TT 
class=literal>Session</TT>&#65292;&#20309;&#26102;&#20851;&#38381;<TT class=literal>Session</TT>&#65311;&#65292;&#20320;&#21448;&#22914;&#20309;&#21010;&#20998;&#25968;&#25454;&#24211;&#20107;&#21153;&#30340;&#36793;&#30028;&#21602;&#65311; 
</P>
<DIV lang=zh-cn class=sect2>
<DIV class=titlepage>
<DIV>
<DIV>
<H3 class=title><A name=transactions-basics-uow></A>11.1.1.&nbsp;&#25805;&#20316;&#21333;&#20803;(Unit of 
work)</H3></DIV></DIV>
<DIV></DIV></DIV>
<P>&#39318;&#20808;&#65292;&#21035;&#29992;<SPAN 
class=emphasis><EM>session-per-operation</EM></SPAN>&#36825;&#31181;&#21453;&#27169;&#24335;&#20102;&#65292;&#20063;&#23601;&#26159;&#35828;&#65292;&#22312;&#21333;&#20010;&#32447;&#31243;&#20013;&#65292; 
&#19981;&#35201;&#22240;&#20026;&#19968;&#27425;&#31616;&#21333;&#30340;&#25968;&#25454;&#24211;&#35843;&#29992;&#65292;&#23601;&#25171;&#24320;&#21644;&#20851;&#38381;&#19968;&#27425;<TT class=literal>Session</TT>&#65281;&#25968;&#25454;&#24211;&#20107;&#21153;&#20063;&#26159;&#22914;&#27492;&#12290; 
&#24212;&#29992;&#31243;&#24207;&#20013;&#30340;&#25968;&#25454;&#24211;&#35843;&#29992;&#26159;&#25353;&#29031;&#35745;&#21010;&#22909;&#30340;&#27425;&#24207;&#65292;&#20998;&#32452;&#20026;&#21407;&#23376;&#30340;&#25805;&#20316;&#21333;&#20803;&#12290;&#65288;&#27880;&#24847;&#65292;&#36825;&#20063;&#24847;&#21619;&#30528;&#65292;&#24212;&#29992;&#31243; 
&#24207;&#20013;&#65292;&#22312;&#21333;&#20010;&#30340;SQL&#35821;&#21477;&#21457;&#36865;&#20043;&#21518;&#65292;&#33258;&#21160;&#20107;&#21153;&#25552;&#20132;(auto-commit)&#27169;&#24335;&#22833;&#25928;&#20102;&#12290;&#36825;&#31181;&#27169;&#24335;&#19987;&#38376;&#20026;SQL&#25511;&#21046;&#21488;&#25805;&#20316;&#35774;&#35745;&#30340;&#12290; 
Hibernate&#31105;&#27490;&#31435;&#21363;&#33258;&#21160;&#20107;&#21153;&#25552;&#20132;&#27169;&#24335;&#65292;&#25110;&#32773;&#26399;&#26395;&#24212;&#29992;&#26381;&#21153;&#22120;&#31105;&#27490;&#31435;&#21363;&#33258;&#21160;&#20107;&#21153;&#25552;&#20132;&#27169;&#24335;&#12290;&#65289;&#25968;&#25454;&#24211;&#20107;&#21153;&#32477;&#19981;&#26159;&#21487;&#26377;&#21487;&#26080;&#30340;&#65292;&#20219;&#20309;&#19982;&#25968;&#25454;&#24211;&#20043;&#38388;&#30340;&#36890;&#35759;&#37117;&#24517;&#39035;&#22312;&#26576;&#20010;&#20107;&#21153;&#20013;&#36827;&#34892;&#65292;&#19981;&#31649;&#20320;&#26159;&#22312;&#35835;&#36824;&#26159;&#22312;&#20889;&#25968;&#25454;&#12290;&#23545;&#35835;&#25968;&#25454;&#32780;&#35328;&#65292;&#24212;&#35813;&#36991;&#20813;auto-commit&#34892;&#20026;&#65292;&#22240;&#20026;&#24456;&#22810;&#23567;&#30340;&#20107;&#21153;&#27604;&#19968;&#20010;&#28165;&#26224;&#23450;&#20041;&#30340;&#24037;&#20316;&#21333;&#20803;&#24615;&#33021;&#24046;&#12290;&#21518;&#32773;&#20063;&#26356;&#23481;&#26131;&#32500;&#25252;&#21644;&#25193;&#23637;&#12290; 
</P>
<P>&#22312;&#22810;&#29992;&#25143;&#30340;client/server&#24212;&#29992;&#31243;&#24207;&#20013;&#65292;&#26368;&#24120;&#29992;&#30340;&#27169;&#24335;&#26159; <SPAN 
class=emphasis><EM>&#27599;&#20010;&#35831;&#27714;&#19968;&#20010;&#20250;&#35805;(session-per-request)</EM></SPAN>&#12290; 
&#22312;&#36825;&#31181;&#27169;&#24335;&#19979;&#65292;&#26469;&#33258;&#23458;&#25143;&#31471;&#30340;&#35831;&#27714;&#34987;&#21457;&#36865;&#21040;&#26381;&#21153;&#22120;&#31471;&#65288;&#21363;Hibernate&#25345;&#20037;&#21270;&#23618;&#36816;&#34892;&#30340;&#22320;&#26041;&#65289;&#65292;&#19968; &#20010;&#26032;&#30340;Hibernate <TT 
class=literal>Session</TT>&#34987;&#25171;&#24320;&#65292;&#24182;&#19988;&#25191;&#34892;&#36825;&#20010;&#25805;&#20316;&#21333;&#20803;&#20013;&#25152;&#26377;&#30340;&#25968;&#25454;&#24211;&#25805;&#20316;&#12290; 
&#19968;&#26086;&#25805;&#20316;&#23436;&#25104;&#65288;&#21516;&#26102;&#23545;&#23458;&#25143;&#31471;&#30340;&#21709;&#24212;&#20063;&#20934;&#22791;&#23601;&#32490;&#65289;&#65292;session&#34987;&#21516;&#27493;&#65292;&#28982;&#21518;&#20851;&#38381;&#12290;&#20320;&#20063;&#21487;&#20197;&#20351;&#29992;&#21333; &#20010;&#25968;&#25454;&#24211;&#20107;&#21153;&#26469;&#22788;&#29702;&#23458;&#25143;&#31471;&#35831;&#27714;&#65292;&#22312;&#20320;&#25171;&#24320;<TT 
class=literal>Session</TT>&#20043;&#21518;&#21551;&#21160;&#20107;&#21153;&#65292;&#22312;&#20320;&#20851;&#38381; <TT 
class=literal>Session</TT>&#20043;&#21069;&#25552;&#20132;&#20107;&#21153;&#12290;&#20250;&#35805;&#21644;&#35831;&#27714;&#20043;&#38388;&#30340;&#20851;&#31995;&#26159;&#19968;&#23545;&#19968;&#30340;&#20851;&#31995;&#65292;&#36825;&#31181;&#27169;&#24335;&#23545; &#20110;&#22823;&#22810;&#25968;&#24212;&#29992;&#31243;&#24207;&#26469;&#35828;&#26159;&#24456;&#26834;&#30340;&#12290; </P>
<P>&#23454;&#29616;&#25165;&#26159;&#30495;&#27491;&#30340;&#25361;&#25112;&#12290;Hibernate&#20869;&#32622;&#20102;&#23545;"&#24403;&#21069;session(current session)" 
&#30340;&#31649;&#29702;&#65292;&#29992;&#20110;&#31616;&#21270;&#27492;&#27169;&#24335;&#12290;&#20320;&#35201;&#20570;&#30340;&#19968;&#20999;&#23601;&#26159;&#22312;&#26381;&#21153;&#22120;&#31471;&#35201;&#22788;&#29702;&#35831;&#27714;&#30340;&#26102;&#20505;&#65292;&#24320;&#21551;&#20107;&#21153;&#65292;&#22312;&#21709;&#24212;&#21457;&#36865;&#32473;&#23458;&#25143;&#20043;&#21069;&#32467;&#26463;&#20107;&#21153;&#12290;&#20320;&#21487;&#20197;&#29992;&#20219;&#20309;&#26041;&#24335;&#26469;&#23436;&#25104;&#36825;&#19968;&#25805;&#20316;&#65292;&#36890;&#24120;&#30340;&#26041;&#26696;&#26377;<TT 
class=literal>ServletFilter</TT>&#65292;&#22312;service&#26041;&#27861;&#20013;&#36827;&#34892;pointcut&#30340;AOP&#25318;&#25130;&#22120;&#65292;&#25110;&#32773;proxy/interception&#23481;&#22120;&#12290;EJB&#23481;&#22120;&#26159;&#23454;&#29616;&#27178;&#20999;&#35832;&#22914;EJB 
session bean&#19978;&#30340;&#20107;&#21153;&#20998;&#30028;&#65292;&#29992;CMT&#23545;&#20107;&#21153;&#36827;&#34892;&#22768;&#26126;&#31561;&#26041;&#38754;&#30340;&#26631;&#20934;&#25163;&#27573;&#12290;&#20551;&#33509;&#20320;&#20915;&#23450;&#20351;&#29992;&#32534;&#31243;&#24335;&#30340;&#20107;&#21153;&#20998;&#30028;&#65292;&#35831;&#21442;&#32771;&#26412;&#31456;&#21518;&#38754;&#35762;&#21040;&#30340;Hibernate <TT 
class=literal>Transaction</TT> API&#65292;&#36825;&#23545;&#26131;&#29992;&#24615;&#21644;&#20195;&#30721;&#21487;&#31227;&#26893;&#24615;&#37117;&#26377;&#22909;&#22788;&#12290; </P>
<P>&#22312;&#20219;&#20309;&#26102;&#38388;&#65292;&#20219;&#20309;&#22320;&#26041;&#65292;&#20320;&#30340;&#24212;&#29992;&#20195;&#30721;&#21487;&#20197;&#36890;&#36807;&#31616;&#21333;&#30340;&#35843;&#29992;<TT 
class=literal>sessionFactory.getCurrentSession()</TT>&#26469;&#35775;&#38382;"&#24403;&#21069;session"&#65292;&#29992;&#20110;&#22788;&#29702;&#35831;&#27714;&#12290;&#20320;&#24635;&#26159;&#20250;&#24471;&#21040;&#24403;&#21069;&#25968;&#25454;&#24211;&#20107;&#21153;&#33539;&#22260;&#20869;&#30340;<TT 
class=literal>Session</TT>&#12290;&#22312;&#20351;&#29992;&#26412;&#22320;&#36164;&#28304;&#25110;JTA&#29615;&#22659;&#26102;&#65292;&#24517;&#39035;&#37197;&#32622;&#23427;&#65292;&#35831;&#21442;&#35265;<A 
title=2.5.&nbsp;&#19978;&#19979;&#25991;&#30456;&#20851;&#30340;&#65288;Contextual&#65289;Session 
href="architecture.html#architecture-current-session">&#31532;&nbsp;2.5&nbsp;&#33410; 
“&#19978;&#19979;&#25991;&#30456;&#20851;&#30340;&#65288;Contextual&#65289;Session”</A>&#12290; </P>
<P>&#26377;&#26102;&#65292;&#23558;<TT 
class=literal>Session</TT>&#21644;&#25968;&#25454;&#24211;&#20107;&#21153;&#30340;&#36793;&#30028;&#24310;&#20280;&#21040;"&#23637;&#31034;&#23618;&#34987;&#28210;&#26579;&#21518;"&#20250;&#24102;&#26469;&#20415;&#21033;&#12290;&#26377;&#20123;serlvet&#24212;&#29992;&#31243;&#24207;&#22312;&#23545;&#35831;&#27714;&#36827;&#34892;&#22788;&#29702;&#21518;&#65292;&#26377;&#20010;&#21333;&#29420;&#30340;&#28210;&#26579;&#26399;&#65292;&#36825;&#31181;&#24310;&#20280;&#23545;&#36825;&#31181;&#31243;&#24207;&#29305;&#21035;&#26377;&#29992;&#12290;&#20551;&#33509;&#20320;&#23454;&#29616;&#20320;&#33258;&#24049;&#30340;&#25318;&#25130;&#22120;&#65292;&#25226;&#20107;&#21153;&#36793;&#30028;&#24310;&#20280;&#21040;&#23637;&#31034;&#23618;&#28210;&#26579;&#32467;&#26463;&#21518;&#38750;&#24120;&#23481;&#26131;&#12290;&#28982;&#32780;&#65292;&#20551;&#33509;&#20320;&#20381;&#36182;&#26377;&#23481;&#22120;&#31649;&#29702;&#20107;&#21153;&#30340;EJB&#65292;&#36825;&#23601;&#19981;&#22826;&#23481;&#26131;&#20102;&#65292;&#22240;&#20026;&#20107;&#21153;&#20250;&#22312;EJB&#26041;&#27861;&#36820;&#22238;&#21518;&#32467;&#26463;&#65292;&#32780;&#37027;&#26159;&#22312;&#20219;&#20309;&#23637;&#31034;&#23618;&#28210;&#26579;&#24320;&#22987;&#20043;&#21069;&#12290;&#35831;&#35775;&#38382;Hibernate&#32593;&#31449;&#21644;&#35770;&#22363;&#65292;&#20320;&#21487;&#20197;&#25214;&#21040;<SPAN 
class=emphasis><EM>Open Session in View</EM></SPAN>&#36825;&#19968;&#27169;&#24335;&#30340;&#25552;&#31034;&#21644;&#31034;&#20363;&#12290; </P></DIV>
<DIV lang=zh-cn class=sect2>
<DIV class=titlepage>
<DIV>
<DIV>
<H3 class=title><A 
name=transactions-basics-apptx></A>11.1.2.&nbsp;&#38271;&#23545;&#35805;</H3></DIV></DIV>
<DIV></DIV></DIV>
<P>session-per-request&#27169;&#24335;&#19981;&#20165;&#20165;&#26159;&#19968;&#20010;&#21487;&#20197;&#29992;&#26469;&#35774;&#35745;&#25805;&#20316;&#21333;&#20803;&#30340;&#26377;&#29992;&#27010;&#24565;&#12290;&#24456;&#22810;&#19994;&#21153;&#22788;&#29702;&#37117;&#38656; 
&#35201;&#19968;&#31995;&#21015;&#23436;&#25972;&#30340;&#19982;&#29992;&#25143;&#20043;&#38388;&#30340;&#20132;&#20114;&#65292;&#32780;&#36825;&#20123;&#29992;&#25143;&#26159;&#25351;&#23545;&#25968;&#25454;&#24211;&#26377;&#20132;&#21449;&#35775;&#38382;&#30340;&#29992;&#25143;&#12290;&#22312;&#22522;&#20110;web&#30340;&#24212;&#29992;&#21644;&#20225;&#19994; &#24212;&#29992;&#20013;&#65292;&#36328;&#29992;&#25143;&#20132;&#20114;&#30340;&#25968;&#25454;&#24211;&#20107;&#21153;&#26159;&#26080;&#27861;&#25509;&#21463;&#30340;&#12290;&#32771;&#34385;&#19979;&#38754;&#30340;&#20363;&#23376;&#65306; 
</P>
<DIV class=itemizedlist>
<UL type=disc>
  <LI>
  <P>&#22312;&#30028;&#38754;&#30340;&#31532;&#19968;&#23631;&#65292;&#25171;&#24320;&#23545;&#35805;&#26694;&#65292;&#29992;&#25143;&#25152;&#30475;&#21040;&#30340;&#25968;&#25454;&#26159;&#34987;&#19968;&#20010;&#29305;&#23450;&#30340; <TT class=literal>Session</TT> &#21644;&#25968;&#25454; 
  &#24211;&#20107;&#21153;&#36733;&#20837;(load)&#30340;&#12290;&#29992;&#25143;&#21487;&#20197;&#38543;&#24847;&#20462;&#25913;&#23545;&#35805;&#26694;&#20013;&#30340;&#25968;&#25454;&#23545;&#35937;&#12290; </P>
  <LI>
  <P>5&#20998;&#38047;&#21518;&#65292;&#29992;&#25143;&#28857;&#20987;“&#20445;&#23384;”&#65292;&#26399;&#26395;&#25152;&#20570;&#20986;&#30340;&#20462;&#25913;&#34987;&#25345;&#20037;&#21270;&#65307;&#21516;&#26102;&#20182;&#20063;&#26399;&#26395;&#33258;&#24049;&#26159;&#21807;&#19968;&#20462;&#25913;&#36825;&#20010;&#20449;&#24687;&#30340;&#20154;&#65292;&#19981;&#20250;&#20986;&#29616; &#20462;&#25913;&#20914;&#31361;&#12290; 
</P></LI></UL></DIV>
<P>&#20174;&#29992;&#25143;&#30340;&#35282;&#24230;&#26469;&#30475;&#65292;&#25105;&#20204;&#25226;&#36825;&#20010;&#25805;&#20316;&#21333;&#20803;&#31216;&#20026;&#38271;&#26102;&#38388;&#36816;&#34892;&#30340;<SPAN 
class=emphasis><EM>&#23545;&#35805;</EM></SPAN>&#65288;conversation&#65289;,&#25110;&#32773;(or <SPAN 
class=emphasis><EM>&#24212;&#29992;&#20107;&#21153;</EM></SPAN>,application transaction)&#12290; 
&#22312;&#20320;&#30340;&#24212;&#29992;&#31243;&#24207;&#20013;&#65292;&#21487;&#20197;&#26377;&#24456;&#22810;&#31181;&#26041;&#27861;&#26469;&#23454;&#29616;&#23427;&#12290; </P>
<P>&#22836;&#19968;&#20010;&#24188;&#31258;&#30340;&#20570;&#27861;&#26159;&#65292;&#22312;&#29992;&#25143;&#24605;&#32771;&#30340;&#36807;&#31243;&#20013;&#65292;&#20445;&#25345;<TT class=literal>Session</TT>&#21644;&#25968;&#25454;&#24211;&#20107;&#21153;&#26159;&#25171;&#24320;&#30340;&#65292; 
&#20445;&#25345;&#25968;&#25454;&#24211;&#38145;&#23450;&#65292;&#20197;&#38459;&#27490;&#24182;&#21457;&#20462;&#25913;&#65292;&#20174;&#32780;&#20445;&#35777;&#25968;&#25454;&#24211;&#20107;&#21153;&#38548;&#31163;&#32423;&#21035;&#21644;&#21407;&#23376;&#25805;&#20316;&#12290;&#36825;&#31181;&#26041;&#24335;&#24403;&#28982;&#26159;&#19968;&#20010;&#21453;&#27169;&#24335;&#65292; &#22240;&#20026;&#38145;&#20105;&#29992;&#20250;&#23548;&#33268;&#24212;&#29992;&#31243;&#24207;&#26080;&#27861;&#25193;&#23637;&#24182;&#21457;&#29992;&#25143;&#30340;&#25968;&#30446;&#12290; </P>
<P>&#24456;&#26126;&#26174;&#65292;&#25105;&#20204;&#24517;&#39035;&#20351;&#29992;&#22810;&#20010;&#25968;&#25454;&#24211;&#20107;&#21153;&#26469;&#23454;&#29616;&#36825;&#20010;&#23545;&#35805;&#12290;&#22312;&#36825;&#20010;&#20363;&#23376;&#20013;&#65292;&#32500;&#25252;&#19994;&#21153;&#22788;&#29702;&#30340; 
&#20107;&#21153;&#38548;&#31163;&#21464;&#25104;&#20102;&#24212;&#29992;&#31243;&#24207;&#23618;&#30340;&#37096;&#20998;&#36131;&#20219;&#12290;&#19968;&#20010;&#23545;&#35805;&#36890;&#24120;&#36328;&#36234;&#22810;&#20010;&#25968;&#25454;&#24211;&#20107;&#21153;&#12290;&#22914;&#26524;&#20165;&#20165;&#21482;&#26377;&#19968; 
&#20010;&#25968;&#25454;&#24211;&#20107;&#21153;&#65288;&#26368;&#21518;&#30340;&#37027;&#20010;&#20107;&#21153;&#65289;&#20445;&#23384;&#26356;&#26032;&#36807;&#30340;&#25968;&#25454;&#65292;&#32780;&#25152;&#26377;&#20854;&#20182;&#20107;&#21153;&#21482;&#26159;&#21333;&#32431;&#30340;&#35835;&#21462;&#25968;&#25454;&#65288;&#20363;&#22914;&#22312;&#19968; 
&#20010;&#36328;&#36234;&#22810;&#20010;&#35831;&#27714;/&#21709;&#24212;&#21608;&#26399;&#30340;&#21521;&#23548;&#39118;&#26684;&#30340;&#23545;&#35805;&#26694;&#20013;&#65289;&#65292;&#37027;&#20040;&#24212;&#29992;&#31243;&#24207;&#20107;&#21153;&#23558;&#20445;&#35777;&#20854;&#21407;&#23376;&#24615;&#12290;&#36825;&#31181;&#26041;&#24335;&#27604;&#21548; 
&#36215;&#26469;&#36824;&#35201;&#23481;&#26131;&#23454;&#29616;&#65292;&#29305;&#21035;&#26159;&#24403;&#20320;&#20351;&#29992;&#20102;Hibernate&#30340;&#19979;&#36848;&#29305;&#24615;&#30340;&#26102;&#20505;&#65306; </P>
<DIV class=itemizedlist>
<UL type=disc>
  <LI>
  <P><SPAN class=emphasis><EM>&#33258;&#21160;&#29256;&#26412;&#21270;</EM></SPAN> - Hibernate&#33021;&#22815;&#33258;&#21160;&#36827;&#34892;&#20048;&#35266;&#24182;&#21457;&#25511;&#21046; &#65292;&#22914;&#26524;&#22312;&#29992;&#25143;&#24605;&#32771; 
  &#30340;&#36807;&#31243;&#20013;&#21457;&#29983;&#24182;&#21457;&#20462;&#25913;&#65292;Hibernate&#33021;&#22815;&#33258;&#21160;&#26816;&#27979;&#21040;&#12290;&#19968;&#33324;&#25105;&#20204;&#21482;&#22312;&#23545;&#35805;&#32467;&#26463;&#26102;&#25165;&#26816;&#26597;&#12290; </P>
  <LI>
  <P><SPAN class=emphasis><EM>&#33073;&#31649;&#23545;&#35937;</EM></SPAN>&#65288;Detached Objects&#65289;- 
  &#22914;&#26524;&#20320;&#20915;&#23450;&#37319;&#29992;&#21069;&#38754;&#24050;&#32463;&#35752;&#35770;&#36807;&#30340; <SPAN 
  class=emphasis><EM>session-per-request</EM></SPAN>&#27169;&#24335;&#65292;&#25152;&#26377;&#36733;&#20837;&#30340;&#23454;&#20363;&#22312;&#29992;&#25143;&#24605;&#32771;&#30340;&#36807;&#31243; 
  &#20013;&#37117;&#22788;&#20110;&#19982;Session&#33073;&#31163;&#30340;&#29366;&#24577;&#12290;Hibernate&#20801;&#35768;&#20320;&#25226;&#19982;Session&#33073;&#31163;&#30340;&#23545;&#35937;&#37325;&#26032;&#20851;&#32852;&#21040;Session &#19978;&#65292;&#24182;&#19988;&#23545;&#20462;&#25913;&#36827;&#34892;&#25345;&#20037;&#21270;&#65292;&#36825;&#31181;&#27169;&#24335;&#34987;&#31216;&#20026; 
  <SPAN 
  class=emphasis><EM>session-per-request-with-detached-objects</EM></SPAN>&#12290;&#33258;&#21160;&#29256;&#26412;&#21270;&#34987;&#29992;&#26469;&#38548;&#31163;&#24182;&#21457;&#20462;&#25913;&#12290; 
  </P>
  <LI>
  <P><SPAN class=emphasis><EM>Extended (or Long) Session</EM></SPAN> - Hibernate 
  &#30340;<TT class=literal>Session</TT> 
  &#21487;&#20197;&#22312;&#25968;&#25454;&#24211;&#20107;&#21153;&#25552;&#20132;&#20043;&#21518;&#21644;&#24213;&#23618;&#30340;JDBC&#36830;&#25509;&#26029;&#24320;&#65292;&#24403;&#19968;&#20010;&#26032;&#30340;&#23458;&#25143;&#31471;&#35831;&#27714;&#21040;&#26469;&#30340;&#26102;&#20505;&#65292;&#23427;&#21448;&#37325;&#26032;&#36830;&#25509;&#19978;&#24213;&#23618;&#30340; JDBC&#36830;&#25509;&#12290;&#36825;&#31181;&#27169;&#24335;&#34987;&#31216;&#20043;&#20026;<SPAN 
  class=emphasis><EM>session-per-conversation</EM></SPAN>&#65292;&#36825;&#31181;&#24773;&#20917;&#21487; 
  &#33021;&#20250;&#36896;&#25104;&#19981;&#24517;&#35201;&#30340;Session&#21644;JDBC&#36830;&#25509;&#30340;&#37325;&#26032;&#20851;&#32852;&#12290;&#33258;&#21160;&#29256;&#26412;&#21270;&#34987;&#29992;&#26469;&#38548;&#31163;&#24182;&#21457;&#20462;&#25913;, <TT 
  class=literal>Session</TT>&#36890;&#24120;&#19981;&#20801;&#35768;&#33258;&#21160;flush,&#32780;&#26159;&#26126;&#30830;flush&#12290; </P></LI></UL></DIV>
<P><SPAN 
class=emphasis><EM>session-per-request-with-detached-objects</EM></SPAN> &#21644; <SPAN 
class=emphasis><EM>session-per-conversation</EM></SPAN> &#21508;&#26377;&#20248;&#32570;&#28857;&#65292;&#25105;&#20204;&#22312;&#26412;&#31456;&#21518;&#38754;&#20048;&#35266;&#24182;&#21457; 
&#25511;&#21046;&#37027;&#37096;&#20998;&#20877;&#36827;&#34892;&#35752;&#35770;&#12290; </P></DIV>
<DIV lang=zh-cn class=sect2>
<DIV class=titlepage>
<DIV>
<DIV>
<H3 class=title><A 
name=transactions-basics-identity></A>11.1.3.&nbsp;&#20851;&#27880;&#23545;&#35937;&#26631;&#35782;(Considering object 
identity)</H3></DIV></DIV>
<DIV></DIV></DIV>
<P>&#24212;&#29992;&#31243;&#24207;&#21487;&#33021;&#22312;&#20004;&#20010;&#19981;&#21516;&#30340;<TT class=literal>Session</TT>&#20013;&#24182;&#21457;&#35775;&#38382;&#21516;&#19968;&#25345;&#20037;&#21270;&#29366;&#24577;&#65292;&#20294;&#26159;&#65292; &#19968;&#20010;&#25345;&#20037;&#21270;&#31867;&#30340;&#23454;&#20363;&#26080;&#27861;&#22312;&#20004;&#20010; <TT 
class=literal>Session</TT>&#20013;&#20849;&#20139;&#12290;&#22240;&#27492;&#26377;&#20004;&#31181;&#19981;&#21516;&#30340;&#26631;&#35782;&#35821;&#20041;&#65306; </P>
<P></P>
<DIV class=variablelist>
<DL>
  <DT><SPAN class=term>&#25968;&#25454;&#24211;&#26631;&#35782;</SPAN>
  <DD>
  <P><TT class=literal>foo.getId().equals( bar.getId() )</TT> </P>
  <DT><SPAN class=term>JVM &#26631;&#35782;</SPAN>
  <DD>
  <P><TT class=literal>foo==bar</TT> </P></DD></DL></DIV>
<P></P>
<P>&#23545;&#20110;&#37027;&#20123;&#20851;&#32852;&#21040; <SPAN class=emphasis><EM>&#29305;&#23450;</EM></SPAN><TT class=literal>Session</TT> 
&#65288;&#20063;&#23601;&#26159;&#22312;&#21333;&#20010;<TT class=literal>Session</TT>&#30340;&#33539;&#22260;&#20869;&#65289;&#19978;&#30340;&#23545;&#35937;&#26469;&#35828;&#65292;&#36825; 
&#20004;&#31181;&#26631;&#35782;&#30340;&#35821;&#20041;&#26159;&#31561;&#20215;&#30340;&#65292;&#19982;&#25968;&#25454;&#24211;&#26631;&#35782;&#23545;&#24212;&#30340;JVM&#26631;&#35782;&#26159;&#30001;Hibernate&#26469;&#20445; &#35777;&#30340;&#12290;&#19981;&#36807;&#65292;&#24403;&#24212;&#29992;&#31243;&#24207;&#22312;&#20004;&#20010;&#19981;&#21516;&#30340;session&#20013;&#24182;&#21457;&#35775;&#38382;&#20855;&#26377;&#21516;&#19968;&#25345;&#20037;&#21270;&#26631; 
&#35782;&#30340;&#19994;&#21153;&#23545;&#35937;&#23454;&#20363;&#30340;&#26102;&#20505;&#65292;&#36825;&#20010;&#19994;&#21153;&#23545;&#35937;&#30340;&#20004;&#20010;&#23454;&#20363;&#20107;&#23454;&#19978;&#26159;&#19981;&#30456;&#21516;&#30340;&#65288;&#20174; JVM&#35782;&#21035;&#26469;&#30475;&#65289;&#12290;&#36825;&#31181;&#20914;&#31361;&#21487;&#20197;&#36890;&#36807;&#22312;&#21516;&#27493;&#21644;&#25552;&#20132;&#30340;&#26102;&#20505;&#20351;&#29992;&#33258;&#21160;&#29256;&#26412;&#21270;&#21644;&#20048; &#35266;&#38145;&#23450;&#26041;&#27861;&#26469;&#35299;&#20915;&#12290; 
</P>
<P></P>
<P>&#36825;&#31181;&#26041;&#24335;&#25226;&#20851;&#20110;&#24182;&#21457;&#30340;&#22836;&#30140;&#38382;&#39064;&#30041;&#32473;&#20102;Hibernate&#21644;&#25968;&#25454;&#24211;&#65307;&#30001;&#20110;&#22312;&#21333;&#20010;&#32447;&#31243;&#20869;&#65292;&#25805;&#20316;&#21333;&#20803;&#20013;&#30340;&#23545;&#35937;&#35782;&#21035;&#19981; 
&#38656;&#35201;&#20195;&#20215;&#26114;&#36149;&#30340;&#38145;&#23450;&#25110;&#20854;&#20182;&#24847;&#20041;&#19978;&#30340;&#21516;&#27493;&#65292;&#22240;&#27492;&#23427;&#21516;&#26102;&#21487;&#20197;&#25552;&#20379;&#26368;&#22909;&#30340;&#21487;&#20280;&#32553;&#24615;&#12290;&#21482;&#35201;&#22312;&#21333;&#20010;&#32447;&#31243;&#21482;&#25345;&#26377;&#19968;&#20010; <TT 
class=literal>Session</TT>&#65292;&#24212;&#29992;&#31243;&#24207;&#23601;&#19981;&#38656;&#35201;&#21516;&#27493;&#20219;&#20309;&#19994;&#21153;&#23545;&#35937;&#12290;&#22312;<TT class=literal>Session</TT> 
&#30340;&#33539;&#22260;&#20869;&#65292;&#24212;&#29992;&#31243;&#24207;&#21487;&#20197;&#25918;&#24515;&#30340;&#20351;&#29992;<TT class=literal>==</TT>&#36827;&#34892;&#23545;&#35937;&#27604;&#36739;&#12290; </P>
<P></P>
<P>&#19981;&#36807;&#65292;&#24212;&#29992;&#31243;&#24207;&#22312;<TT class=literal>Session</TT>&#30340;&#22806;&#38754;&#20351;&#29992;<TT class=literal>==</TT>&#36827;&#34892;&#23545;&#35937;&#27604;&#36739;&#21487;&#33021;&#20250; 
&#23548;&#33268;&#26080;&#27861;&#39044;&#26399;&#30340;&#32467;&#26524;&#12290;&#22312;&#19968;&#20123;&#26080;&#27861;&#39044;&#26009;&#30340;&#22330;&#21512;&#65292;&#20363;&#22914;&#65292;&#22914;&#26524;&#20320;&#25226;&#20004;&#20010;&#33073;&#31649;&#23545;&#35937;&#23454;&#20363;&#25918;&#36827;&#21516;&#19968;&#20010; <TT 
class=literal>Set</TT>&#30340;&#26102;&#20505;&#65292;&#23601;&#21487;&#33021;&#21457;&#29983;&#12290;&#36825;&#20004;&#20010;&#23545;&#35937;&#23454;&#20363;&#21487;&#33021;&#26377;&#21516;&#19968;&#20010;&#25968;&#25454;&#24211;&#26631;&#35782;&#65288;&#20063;&#23601;&#26159;&#35828;&#65292; 
&#20182;&#20204;&#20195;&#34920;&#20102;&#34920;&#30340;&#21516;&#19968;&#34892;&#25968;&#25454;&#65289;&#65292;&#20174;JVM&#26631;&#35782;&#30340;&#23450;&#20041;&#19978;&#26469;&#35828;&#65292;&#23545;&#33073;&#31649;&#30340;&#23545;&#35937;&#32780;&#35328;&#65292;Hibernate&#26080;&#27861;&#20445;&#35777;&#20182;&#20204; &#30340;&#30340;JVM&#26631;&#35782;&#19968;&#33268;&#12290;&#24320;&#21457;&#20154;&#21592;&#24517;&#39035;&#35206;&#30422;&#25345;&#20037;&#21270;&#31867;&#30340;<TT 
class=literal>equals()</TT>&#26041;&#27861;&#21644; <TT class=literal>hashCode()</TT> 
&#26041;&#27861;&#65292;&#20174;&#32780;&#23454;&#29616;&#33258;&#23450;&#20041;&#30340;&#23545;&#35937;&#30456;&#31561;&#35821;&#20041;&#12290;&#35686;&#21578;&#65306;&#19981;&#35201;&#20351;&#29992;&#25968;&#25454;&#24211;&#26631;&#35782; &#26469;&#23454;&#29616;&#23545;&#35937;&#30456;&#31561;&#65292;&#24212;&#35813;&#20351;&#29992;&#19994;&#21153;&#38190;&#20540;&#65292;&#30001;&#21807;&#19968;&#30340;&#65292;&#36890;&#24120;&#19981;&#21464;&#30340;&#23646;&#24615;&#32452;&#25104;&#12290;&#24403;&#19968;&#20010;&#30636;&#26102;&#23545;&#35937;&#34987;&#25345;&#20037;&#21270;&#30340;&#26102; 
&#20505;&#65292;&#23427;&#30340;&#25968;&#25454;&#24211;&#26631;&#35782;&#20250;&#21457;&#29983;&#25913;&#21464;&#12290;&#22914;&#26524;&#19968;&#20010;&#30636;&#26102;&#23545;&#35937;&#65288;&#36890;&#24120;&#20063;&#21253;&#25324;&#33073;&#31649;&#23545;&#35937;&#23454;&#20363;&#65289;&#34987;&#25918;&#20837;&#19968; &#20010;<TT 
class=literal>Set</TT>&#65292;&#25913;&#21464;&#23427;&#30340;hashcode&#20250;&#23548;&#33268;&#19982;&#36825;&#20010;<TT class=literal>Set</TT>&#30340;&#20851;&#31995;&#20013;&#26029;&#12290;&#34429; 
&#28982;&#19994;&#21153;&#38190;&#20540;&#30340;&#23646;&#24615;&#19981;&#35937;&#25968;&#25454;&#24211;&#20027;&#38190;&#37027;&#26679;&#31283;&#23450;&#19981;&#21464;&#65292;&#20294;&#26159;&#20320;&#21482;&#38656;&#35201;&#20445;&#35777;&#22312;&#21516;&#19968;&#20010;<TT class=literal>Set</TT> 
&#20013;&#30340;&#23545;&#35937;&#23646;&#24615;&#30340;&#31283;&#23450;&#24615;&#23601;&#36275;&#22815;&#20102;&#12290;&#35831;&#21040;Hibernate&#32593;&#31449;&#21435;&#23547;&#27714;&#36825;&#20010;&#38382;&#39064;&#26356;&#22810;&#30340;&#35814;&#32454;&#30340;&#35752;&#35770;&#12290;&#35831;&#27880;&#24847;&#65292;&#36825;&#19981;&#26159;&#19968; 
&#20010;&#26377;&#20851;Hibernate&#30340;&#38382;&#39064;&#65292;&#32780;&#20165;&#20165;&#26159;&#19968;&#20010;&#20851;&#20110;Java&#23545;&#35937;&#26631;&#35782;&#21644;&#21028;&#31561;&#34892;&#20026;&#22914;&#20309;&#23454;&#29616;&#30340;&#38382;&#39064;&#12290; </P>
<P></P></DIV>
<DIV lang=zh-cn class=sect2>
<DIV class=titlepage>
<DIV>
<DIV>
<H3 class=title><A 
name=transactions-basics-issues></A>11.1.4.&nbsp;&#24120;&#35265;&#38382;&#39064;</H3></DIV></DIV>
<DIV></DIV></DIV>
<P>&#20915;&#19981;&#35201;&#20351;&#29992;&#21453;&#27169;&#24335;<SPAN class=emphasis><EM>session-per-user-session</EM></SPAN>&#25110;&#32773;<SPAN 
class=emphasis><EM> session-per-application</EM></SPAN>&#65288;&#24403;&#28982;&#65292;&#36825;&#20010;&#35268;&#23450;&#20960;&#20046;&#27809;&#26377;&#20363;&#22806;&#65289;&#12290;&#35831;&#27880;&#24847;&#65292; 
&#19979;&#36848;&#19968;&#20123;&#38382;&#39064;&#21487;&#33021;&#20063;&#20250;&#20986;&#29616;&#22312;&#25105;&#20204;&#25512;&#33616;&#30340;&#27169;&#24335;&#20013;&#65292;&#22312;&#20320;&#20316;&#20986;&#26576;&#20010;&#35774;&#35745;&#20915;&#23450;&#20043;&#21069;&#65292;&#35831;&#21153;&#24517;&#29702;&#35299;&#35813;&#27169;&#24335;&#30340;&#24212;&#29992;&#21069;&#25552;&#12290; </P>
<DIV class=itemizedlist>
<UL type=disc>
  <LI>
  <P><TT class=literal>Session</TT> &#23545;&#35937;&#26159;&#38750;&#32447;&#31243;&#23433;&#20840;&#30340;&#12290;&#22914;&#26524;&#19968;&#20010;<TT class=literal>Session</TT> 
  &#23454;&#20363;&#20801;&#35768;&#20849;&#20139;&#30340;&#35805;&#65292;&#37027;&#20123;&#25903;&#25345;&#24182;&#21457;&#36816;&#34892;&#30340;&#19996;&#19996;&#65292;&#20363;&#22914;HTTP request&#65292;session beans,&#25110;&#32773;&#26159; Swing 
  workers&#65292;&#23558;&#20250;&#23548;&#33268;&#20986;&#29616;&#36164;&#28304;&#20105;&#29992;&#65288;race condition&#65289;&#12290;&#22914;&#26524;&#22312;<TT class=literal>HttpSession</TT>&#20013;&#26377; 
  Hibernate &#30340;<TT class=literal>Session</TT>&#30340;&#35805;&#65288;&#31245;&#21518;&#35752;&#35770;&#65289;&#65292;&#20320;&#24212;&#35813;&#32771;&#34385;&#21516;&#27493;&#35775;&#38382;&#20320;&#30340;Http session&#12290; 
  &#21542;&#21017;&#65292;&#21482;&#35201;&#29992;&#25143;&#36275;&#22815;&#24555;&#30340;&#28857;&#20987;&#27983;&#35272;&#22120;&#30340;“&#21047;&#26032;”&#65292;&#23601;&#20250;&#23548;&#33268;&#20004;&#20010;&#24182;&#21457;&#36816;&#34892;&#32447;&#31243;&#20351;&#29992;&#21516;&#19968;&#20010; <TT class=literal>Session</TT>&#12290; </P>
  <LI>
  <P>&#19968;&#20010;&#30001;Hibernate&#25243;&#20986;&#30340;&#24322;&#24120;&#24847;&#21619;&#30528;&#20320;&#24517;&#39035;&#31435;&#21363;&#22238;&#28378;&#25968;&#25454;&#24211;&#20107;&#21153;&#65292;&#24182;&#31435;&#21363;&#20851;&#38381;<TT class=literal>Session</TT> 
  &#65288;&#31245;&#21518;&#20250;&#23637;&#24320;&#35752;&#35770;&#65289;&#12290;&#22914;&#26524;&#20320;&#30340;<TT class=literal>Session</TT>&#32465;&#23450;&#21040;&#19968;&#20010;&#24212;&#29992;&#31243;&#24207;&#19978;&#65292;&#20320;&#24517; 
  &#39035;&#20572;&#27490;&#35813;&#24212;&#29992;&#31243;&#24207;&#12290;&#22238;&#28378;&#25968;&#25454;&#24211;&#20107;&#21153;&#24182;&#19981;&#20250;&#25226;&#20320;&#30340;&#19994;&#21153;&#23545;&#35937;&#36864;&#22238;&#21040;&#20107;&#21153;&#21551;&#21160;&#26102;&#20505;&#30340;&#29366;&#24577;&#12290;&#36825; 
  &#24847;&#21619;&#30528;&#25968;&#25454;&#24211;&#29366;&#24577;&#21644;&#19994;&#21153;&#23545;&#35937;&#29366;&#24577;&#19981;&#21516;&#27493;&#12290;&#36890;&#24120;&#24773;&#20917;&#19979;&#65292;&#36825;&#19981;&#26159;&#20160;&#20040;&#38382;&#39064;&#65292;&#22240;&#20026;&#24322;&#24120;&#26159;&#19981;&#21487; &#24674;&#22797;&#30340;,&#20320;&#24517;&#39035;&#22312;&#22238;&#28378;&#20043;&#21518;&#37325;&#26032;&#24320;&#22987;&#25191;&#34892;&#12290; </P>
  <LI>
  <P><TT class=literal>Session</TT> &#32531;&#23384;&#20102;&#22788;&#20110;&#25345;&#20037;&#21270;&#29366;&#24577;&#30340;&#27599;&#20010;&#23545;&#35937;&#65288;Hibernate&#20250;&#30417;&#35270;&#21644;&#26816;&#26597;&#33039;&#25968;&#25454;&#65289;&#12290; 
  &#36825;&#24847;&#21619;&#30528;&#65292;&#22914;&#26524;&#20320;&#35753;<TT class=literal>Session</TT>&#25171;&#24320;&#24456;&#38271;&#19968;&#27573;&#26102;&#38388;&#65292;&#25110;&#26159;&#20165;&#20165;&#36733;&#20837;&#20102;&#36807;&#22810;&#30340;&#25968;&#25454;&#65292; <TT 
  class=literal>Session</TT>&#21344;&#29992;&#30340;&#20869;&#23384;&#20250;&#19968;&#30452;&#22686;&#38271;&#65292;&#30452;&#21040;&#25243;&#20986;OutOfMemoryException&#24322;&#24120;&#12290;&#36825;&#20010; 
  &#38382;&#39064;&#30340;&#19968;&#20010;&#35299;&#20915;&#26041;&#27861;&#26159;&#35843;&#29992;<TT class=literal>clear()</TT> &#21644;<TT class=literal>evict()</TT>&#26469;&#31649;&#29702; 
  <TT class=literal>Session</TT>&#30340;&#32531;&#23384;&#65292;&#20294;&#26159;&#22914;&#26524;&#20320;&#38656;&#35201;&#22823;&#25209;&#37327;&#25968;&#25454;&#25805;&#20316;&#30340;&#35805;&#65292;&#26368;&#22909;&#32771;&#34385; &#20351;&#29992;&#23384;&#20648;&#36807;&#31243;&#12290;&#22312;<A 
  title="&#31532;&nbsp;13&nbsp;&#31456;&nbsp;&#25209;&#37327;&#22788;&#29702;&#65288;Batch processing&#65289;" 
  href="batch.html">&#31532;&nbsp;13&nbsp;&#31456; <I>&#25209;&#37327;&#22788;&#29702;&#65288;Batch 
  processing&#65289;</I></A>&#20013;&#26377;&#19968;&#20123;&#35299;&#20915;&#26041;&#26696;&#12290;&#22312;&#29992;&#25143;&#20250;&#35805;&#26399;&#38388;&#19968;&#30452;&#20445;&#25345; <TT 
  class=literal>Session</TT>&#25171;&#24320;&#20063;&#24847;&#21619;&#30528;&#20986;&#29616;&#33039;&#25968;&#25454;&#30340;&#21487;&#33021;&#24615;&#24456;&#39640;&#12290; </P></LI></UL></DIV></DIV></DIV>
<DIV lang=zh-cn class=sect1>
<DIV class=titlepage>
<DIV>
<DIV>
<H2 class=title style="CLEAR: both"><A 
name=transactions-demarcation></A>11.2.&nbsp;&#25968;&#25454;&#24211;&#20107;&#21153;&#22768;&#26126;</H2></DIV></DIV>
<DIV></DIV></DIV>
<P>&#25968;&#25454;&#24211;&#65288;&#25110;&#32773;&#31995;&#32479;&#65289;&#20107;&#21153;&#30340;&#22768;&#26126;&#24635;&#26159;&#24517;&#39035;&#30340;&#12290;&#22312;&#25968;&#25454;&#24211;&#20107;&#21153;&#20043;&#22806;&#65292;&#23601;&#26080;&#27861;&#21644;&#25968;&#25454;&#24211;&#36890;&#35759;&#65288;&#36825;&#21487;&#33021;&#20250;&#35753;&#37027;&#20123;&#20064;&#24815;&#20110; 
&#33258;&#21160;&#25552;&#20132;&#20107;&#21153;&#27169;&#24335;&#30340;&#24320;&#21457;&#20154;&#21592;&#24863;&#21040;&#36855;&#24785;&#65289;&#12290;&#27704;&#36828;&#20351;&#29992;&#28165;&#26224;&#30340;&#20107;&#21153;&#22768;&#26126;&#65292;&#21363;&#20351;&#21482;&#35835;&#25805;&#20316;&#20063;&#26159;&#22914;&#27492;&#12290;&#36827;&#34892; 
&#26174;&#24335;&#30340;&#20107;&#21153;&#22768;&#26126;&#24182;&#19981;&#24635;&#26159;&#38656;&#35201;&#30340;&#65292;&#36825;&#21462;&#20915;&#20110;&#20320;&#30340;&#20107;&#21153;&#38548;&#31163;&#32423;&#21035;&#21644;&#25968;&#25454;&#24211;&#30340;&#33021;&#21147;&#65292;&#20294;&#19981;&#31649;&#24590;&#20040;&#35828;&#65292;&#22768;&#26126;&#20107;&#21153;&#24635;&#24402;&#26377;&#30410;&#26080;&#23475;&#12290;&#24403;&#28982;&#65292;&#19968;&#20010;&#21333;&#29420;&#30340;&#25968;&#25454;&#24211;&#20107;&#21153;&#24635;&#26159;&#27604;&#24456;&#22810;&#29712;&#30862;&#30340;&#20107;&#21153;&#24615;&#33021;&#26356;&#22909;&#65292;&#21363;&#26102;&#23545;&#35835;&#25968;&#25454;&#32780;&#35328;&#20063;&#26159;&#19968;&#26679;&#12290; 
</P>
<P>&#19968;&#20010;Hibernate&#24212;&#29992;&#31243;&#24207;&#21487;&#20197;&#36816;&#34892;&#22312;&#38750;&#25176;&#31649;&#29615;&#22659;&#20013;&#65288;&#20063;&#23601;&#26159;&#29420;&#31435;&#36816;&#34892;&#30340;&#24212;&#29992;&#31243;&#24207;&#65292;&#31616;&#21333;Web&#24212;&#29992;&#31243;&#24207;&#65292; 
&#25110;&#32773;Swing&#22270;&#24418;&#26700;&#38754;&#24212;&#29992;&#31243;&#24207;&#65289;&#65292;&#20063;&#21487;&#20197;&#36816;&#34892;&#22312;&#25176;&#31649;&#30340;J2EE&#29615;&#22659;&#20013;&#12290;&#22312;&#19968;&#20010;&#38750;&#25176;&#31649;&#29615;&#22659;&#20013;&#65292;Hibernate 
&#36890;&#24120;&#33258;&#24049;&#36127;&#36131;&#31649;&#29702;&#25968;&#25454;&#24211;&#36830;&#25509;&#27744;&#12290;&#24212;&#29992;&#31243;&#24207;&#24320;&#21457;&#20154;&#21592;&#24517;&#39035;&#25163;&#24037;&#35774;&#32622;&#20107;&#21153;&#22768;&#26126;&#65292;&#25442;&#21477;&#35805;&#35828;&#65292;&#23601;&#26159;&#25163;&#24037;&#21551; 
&#21160;&#65292;&#25552;&#20132;&#65292;&#25110;&#32773;&#22238;&#28378;&#25968;&#25454;&#24211;&#20107;&#21153;&#12290;&#19968;&#20010;&#25176;&#31649;&#30340;&#29615;&#22659;&#36890;&#24120;&#25552;&#20379;&#20102;&#23481;&#22120;&#31649;&#29702;&#20107;&#21153;(CMT)&#65292;&#20363;&#22914;&#20107;&#21153;&#35013;&#37197;&#36890;&#36807;&#21487;&#22768; &#26126;&#30340;&#26041;&#24335;&#23450;&#20041;&#22312;EJB session 
beans&#30340;&#37096;&#32626;&#25551;&#36848;&#31526;&#20013;&#12290;&#21487;&#32534;&#31243;&#24335;&#20107;&#21153;&#22768;&#26126;&#19981;&#20877;&#38656;&#35201;&#65292;&#21363;&#20351;&#26159; <TT class=literal>Session</TT> &#30340;&#21516;&#27493;&#20063;&#21487;&#20197;&#33258;&#21160;&#23436;&#25104;&#12290; </P>
<P>&#35753;&#25345;&#20037;&#23618;&#20855;&#22791;&#21487;&#31227;&#26893;&#24615;&#26159;&#20154;&#20204;&#30340;&#29702;&#24819;,&#36825;&#31181;&#31227;&#26893;&#21457;&#29983;&#22312;&#38750;&#25176;&#31649;&#30340;&#26412;&#22320;&#36164;&#28304;&#29615;&#22659;&#65292;&#19982;&#20381;&#36182;JTA&#20294;&#26159;&#20351;&#29992;BMT&#32780;&#38750;CMT&#30340;&#31995;&#32479;&#20043;&#38388;&#12290;&#22312;&#20004;&#31181;&#24773;&#20917;&#19979;&#20320;&#37117;&#21487;&#20197;&#20351;&#29992;&#32534;&#31243;&#24335;&#30340;&#20107;&#21153;&#31649;&#29702;&#12290;Hibernate&#25552;&#20379;&#20102;&#19968;&#22871;&#31216;&#20026;<TT 
class=literal>Transaction</TT>&#30340;&#23553;&#35013;API&#65292; 
&#29992;&#26469;&#25226;&#20320;&#30340;&#37096;&#32626;&#29615;&#22659;&#20013;&#30340;&#26412;&#22320;&#20107;&#21153;&#31649;&#29702;&#31995;&#32479;&#36716;&#25442;&#21040;Hibernate&#20107;&#21153;&#19978;&#12290;&#36825;&#20010;API&#26159;&#21487;&#36873;&#30340;&#65292;&#20294;&#26159;&#25105;&#20204;&#24378;&#28872; &#25512;&#33616;&#20320;&#20351;&#29992;&#65292;&#38500;&#38750;&#20320;&#29992;CMT session bean&#12290; 
</P>
<P>&#36890;&#24120;&#24773;&#20917;&#19979;&#65292;&#32467;&#26463; <TT class=literal>Session</TT> &#21253;&#21547;&#20102;&#22235;&#20010;&#19981;&#21516;&#30340;&#38454;&#27573;: </P>
<DIV class=itemizedlist>
<UL type=disc compact>
  <LI>
  <P>&#21516;&#27493;session(flush,&#21047;&#20986;&#21040;&#30913;&#30424;&#65289; </P>
  <LI>
  <P>&#25552;&#20132;&#20107;&#21153; </P>
  <LI>
  <P>&#20851;&#38381;session </P>
  <LI>
  <P>&#22788;&#29702;&#24322;&#24120; </P></LI></UL></DIV>
<P>session&#30340;&#21516;&#27493;(flush,&#21047;&#20986;&#65289;&#21069;&#38754;&#24050;&#32463;&#35752;&#35770;&#36807;&#20102;&#65292;&#25105;&#20204;&#29616;&#22312;&#36827;&#19968;&#27493;&#32771;&#23519;&#22312;&#25176;&#31649;&#21644;&#38750;&#25176;&#31649;&#29615;&#22659;&#19979;&#30340;&#20107;&#21153;&#22768;&#26126;&#21644;&#24322;&#24120;&#22788;&#29702;&#12290; </P>
<DIV lang=zh-cn class=sect2>
<DIV class=titlepage>
<DIV>
<DIV>
<H3 class=title><A 
name=transactions-demarcation-nonmanaged></A>11.2.1.&nbsp;&#38750;&#25176;&#31649;&#29615;&#22659;</H3></DIV></DIV>
<DIV></DIV></DIV>
<P>&#22914;&#26524;Hibernat&#25345;&#20037;&#23618;&#36816;&#34892;&#22312;&#19968;&#20010;&#38750;&#25176;&#31649;&#29615;&#22659;&#20013;&#65292;&#25968;&#25454;&#24211;&#36830;&#25509;&#36890;&#24120;&#30001;Hibernate&#30340;&#31616;&#21333;&#65288;&#21363;&#38750;DataSource)&#36830;&#25509;&#27744;&#26426;&#21046; 
&#26469;&#22788;&#29702;&#12290;session/transaction&#22788;&#29702;&#26041;&#24335;&#22914;&#19979;&#25152;&#31034;&#65306; </P><PRE class=programlisting>//Non-managed environment idiom
Session sess = factory.openSession();
Transaction tx = null;
try {
    tx = sess.beginTransaction();

    // do some work
    ...

    tx.commit();
}
catch (RuntimeException e) {
    if (tx != null) tx.rollback();
    throw e; // or display error message
}
finally {
    sess.close();
}</PRE>
<P>&#20320;&#19981;&#38656;&#35201;&#26174;&#24335;<TT class=literal>flush()</TT> <TT class=literal>Session</TT> - &#23545;<TT 
class=literal>commit()</TT>&#30340;&#35843;&#29992;&#20250;&#33258;&#21160;&#35302;&#21457;session&#30340;&#21516;&#27493;(&#21462;&#20915;&#20110;session&#30340;<A 
title=10.10.&nbsp;Session&#21047;&#20986;(flush) 
href="objectstate.html#objectstate-flushing">&#31532;&nbsp;10.10&nbsp;&#33410; 
“Session&#21047;&#20986;(flush)”</A>)&#12290;&#35843;&#29992; <TT class=literal>close()</TT> &#26631;&#24535;session&#30340;&#32467;&#26463;&#12290;<TT 
class=literal>close()</TT>&#26041;&#27861;&#37325;&#35201;&#30340;&#26263;&#31034;&#26159;&#65292;<TT 
class=literal>session</TT>&#37322;&#25918;&#20102;JDBC&#36830;&#25509;&#12290;&#36825;&#27573;Java&#20195;&#30721;&#22312;&#38750;&#25176;&#31649;&#29615;&#22659;&#19979;&#21644;JTA&#29615;&#22659;&#19979;&#37117;&#21487;&#20197;&#36816;&#34892;&#12290; </P>
<P>&#26356;&#21152;&#28789;&#27963;&#30340;&#26041;&#26696;&#26159;Hibernate&#20869;&#32622;&#30340;"current session"&#19978;&#19979;&#25991;&#31649;&#29702;&#65292;&#21069;&#25991;&#24050;&#32463;&#35762;&#36807;&#65306; </P><PRE class=programlisting>// Non-managed environment idiom with getCurrentSession()
try {
    factory.getCurrentSession().beginTransaction();

    // do some work
    ...

    factory.getCurrentSession().getTransaction().commit();
}
catch (RuntimeException e) {
    factory.getCurrentSession().getTransaction().rollback();
    throw e; // or display error message
}</PRE>
<P>&#20320;&#24456;&#21487;&#33021;&#20174;&#26410;&#22312;&#19968;&#20010;&#36890;&#24120;&#30340;&#24212;&#29992;&#31243;&#24207;&#30340;&#19994;&#21153;&#20195;&#30721;&#20013;&#35265;&#36807;&#36825;&#26679;&#30340;&#20195;&#30721;&#29255;&#26029;&#65306;&#33268;&#21629;&#30340;&#65288;&#31995;&#32479;&#65289;&#24322;&#24120;&#24212;&#35813;&#24635;&#26159; 
&#22312;&#24212;&#29992;&#31243;&#24207;“&#39030;&#23618;”&#34987;&#25429;&#33719;&#12290;&#25442;&#21477;&#35805;&#35828;&#65292;&#25191;&#34892;Hibernate&#35843;&#29992;&#30340;&#20195;&#30721;&#65288;&#22312;&#25345;&#20037;&#23618;&#65289;&#21644;&#22788;&#29702; <TT 
class=literal>RuntimeException</TT>&#24322;&#24120;&#30340;&#20195;&#30721;&#65288;&#36890;&#24120;&#21482;&#33021;&#28165;&#29702;&#21644;&#36864;&#20986;&#24212;&#29992;&#31243;&#24207;&#65289;&#24212;&#35813;&#22312;&#19981;&#21516; 
&#30340;&#24212;&#29992;&#31243;&#24207;&#36923;&#36753;&#23618;&#12290;Hibernate&#30340;&#24403;&#21069;&#19978;&#19979;&#25991;&#31649;&#29702;&#21487;&#20197;&#26497;&#22823;&#22320;&#31616;&#21270;&#36825;&#19968;&#35774;&#35745;&#65292;&#20320;&#25152;&#26377;&#30340;&#19968;&#20999;&#23601;&#26159;<TT 
class=literal>SessionFactory</TT>&#12290; &#24322;&#24120;&#22788;&#29702;&#23558;&#22312;&#26412;&#31456;&#31245;&#21518;&#36827;&#34892;&#35752;&#35770;&#12290; </P>
<P>&#35831;&#27880;&#24847;&#65292;&#20320;&#24212;&#35813;&#36873;&#25321; <TT 
class=literal>org.hibernate.transaction.JDBCTransactionFactory</TT> 
(&#36825;&#26159;&#40664;&#35748;&#36873;&#39033;)&#65292;&#23545;&#31532;&#20108;&#20010;&#20363;&#23376;&#26469;&#35828;&#65292;<TT 
class=literal>hibernate.current_session_context_class</TT>&#24212;&#35813;&#26159;<TT 
class=literal>"thread"</TT> </P></DIV>
<DIV lang=zh-cn class=sect2>
<DIV class=titlepage>
<DIV>
<DIV>
<H3 class=title><A 
name=transactions-demarcation-jta></A>11.2.2.&nbsp;&#20351;&#29992;JTA</H3></DIV></DIV>
<DIV></DIV></DIV>
<P>&#22914;&#26524;&#20320;&#30340;&#25345;&#20037;&#23618;&#36816;&#34892;&#22312;&#19968;&#20010;&#24212;&#29992;&#26381;&#21153;&#22120;&#20013;&#65288;&#20363;&#22914;&#65292;&#22312;EJB session beans&#30340;&#21518;&#38754;&#65289;&#65292;Hibernate&#33719;&#21462; 
&#30340;&#27599;&#20010;&#25968;&#25454;&#28304;&#36830;&#25509;&#23558;&#33258;&#21160;&#25104;&#20026;&#20840;&#23616;JTA&#20107;&#21153;&#30340;&#19968;&#37096;&#20998;&#12290; &#20320;&#21487;&#20197;&#23433;&#35013;&#19968;&#20010;&#29420;&#31435;&#30340;JTA&#23454;&#29616;&#65292;&#20351;&#29992;&#23427;&#32780;&#19981;&#20351;&#29992;EJB&#12290;Hibernate&#25552;&#20379;&#20102;&#20004;&#31181;&#31574;&#30053;&#36827;&#34892;JTA&#38598;&#25104;&#12290; 
</P>
<P>&#22914;&#26524;&#20320;&#20351;&#29992;bean&#31649;&#29702;&#20107;&#21153;&#65288;BMT&#65289;&#65292;&#21487;&#20197;&#36890;&#36807;&#20351;&#29992;Hibernate&#30340; <TT class=literal>Transaction</TT> API&#26469;&#21578;&#35785; 
&#24212;&#29992;&#26381;&#21153;&#22120;&#21551;&#21160;&#21644;&#32467;&#26463;BMT&#20107;&#21153;&#12290;&#22240;&#27492;&#65292;&#20107;&#21153;&#31649;&#29702;&#20195;&#30721;&#21644;&#22312;&#38750;&#25176;&#31649;&#29615;&#22659;&#19979;&#26159;&#19968;&#26679;&#30340;&#12290; </P><PRE class=programlisting>// BMT idiom
Session sess = factory.openSession();
Transaction tx = null;
try {
    tx = sess.beginTransaction();

    // do some work
    ...

    tx.commit();
}
catch (RuntimeException e) {
    if (tx != null) tx.rollback();
    throw e; // or display error message
}
finally {
    sess.close();
}</PRE>
<P>&#22914;&#26524;&#20320;&#24076;&#26395;&#20351;&#29992;&#19982;&#20107;&#21153;&#32465;&#23450;&#30340;<TT class=literal>Session</TT>&#65292;&#20063;&#23601;&#26159;&#20351;&#29992;<TT 
class=literal>getCurrentSession()</TT>&#26469;&#31616;&#21270;&#19978;&#19979;&#25991;&#31649;&#29702;&#65292;&#20320;&#23558;&#19981;&#24471;&#19981;&#30452;&#25509;&#20351;&#29992;JTA <TT 
class=literal>UserTransaction</TT>API&#12290; </P><PRE class=programlisting>// BMT idiom with getCurrentSession()
try {
    UserTransaction tx = (UserTransaction)new InitialContext()
                            .lookup("java:comp/UserTransaction");

    tx.begin();

    // Do some work on Session bound to transaction
    factory.getCurrentSession().load(...);
    factory.getCurrentSession().persist(...);

    tx.commit();
}
catch (RuntimeException e) {
    tx.rollback();
    throw e; // or display error message
}</PRE>
<P>&#22312;CMT&#26041;&#24335;&#19979;&#65292;&#20107;&#21153;&#22768;&#26126;&#26159;&#22312;session bean&#30340;&#37096;&#32626;&#25551;&#36848;&#31526;&#20013;&#65292;&#32780;&#19981;&#38656;&#35201;&#32534;&#31243;&#12290; &#22240;&#27492;&#65292;&#20195;&#30721;&#34987;&#31616;&#21270;&#20026;: </P><PRE class=programlisting>// CMT idiom
Session sess = factory.getCurrentSession();

// do some work
...

</PRE>
<P>&#22312;CMT/EJB&#20013;&#29978;&#33267;&#20250;&#33258;&#21160;rollback&#65292;&#22240;&#20026;&#20551;&#33509;&#26377;&#26410;&#25429;&#33719;&#30340;<TT 
class=literal>RuntimeException</TT>&#20174;session bean&#26041;&#27861;&#20013;&#25243;&#20986;&#65292;&#36825;&#23601;&#20250;&#36890;&#30693;&#23481;&#22120;&#25226;&#20840;&#23616;&#20107;&#21153;&#22238;&#28378;&#12290;<SPAN 
class=emphasis><EM>&#36825;&#23601;&#24847;&#21619;&#30528;&#65292;&#22312;BMT&#25110;&#32773;CMT&#20013;&#65292;&#20320;&#26681;&#26412;&#23601;&#19981;&#38656;&#35201;&#20351;&#29992;Hibernate <TT 
class=literal>Transaction</TT> API &#65292;&#20320;&#33258;&#21160;&#24471;&#21040;&#20102;&#32465;&#23450;&#21040;&#20107;&#21153;&#30340;“&#24403;&#21069;”Session&#12290; </EM></SPAN></P>
<P>&#27880;&#24847;&#65292;&#24403;&#20320;&#37197;&#32622;Hibernate&#30340;transaction factory&#30340;&#26102;&#20505;&#65292;&#22312;&#30452;&#25509;&#20351;&#29992;JTA&#30340;&#26102;&#20505;&#65288;BMT&#65289;&#65292;&#20320;&#24212;&#35813;&#36873;&#25321;<TT 
class=literal>org.hibernate.transaction.JTATransactionFactory</TT>,&#22312;CMT session 
bean&#20013;&#36873;&#25321;<TT 
class=literal>org.hibernate.transaction.CMTTransactionFactory</TT>&#12290;&#35760;&#24471;&#20063;&#35201;&#35774;&#32622;<TT 
class=literal>hibernate.transaction.manager_lookup_class</TT>&#12290;&#36824;&#26377;&#65292;&#30830;&#35748;&#20320;&#30340;<TT 
class=literal>hibernate.current_session_context_class</TT>&#26410;&#35774;&#32622;&#65288;&#20026;&#20102;&#21521;&#19979;&#20860;&#23481;&#65289;&#65292;&#25110;&#32773;&#35774;&#32622;&#20026;<TT 
class=literal>"jta"</TT>&#12290; </P>
<P><TT class=literal>getCurrentSession()</TT>&#22312;JTA&#29615;&#22659;&#20013;&#26377;&#19968;&#20010;&#24330;&#31471;&#12290;&#23545;<TT 
class=literal>after_statement</TT>&#36830;&#25509;&#37322;&#25918;&#26041;&#24335;&#26377;&#19968;&#20010;&#35686;&#21578;&#65292;&#36825;&#26159;&#34987;&#40664;&#35748;&#20351;&#29992;&#30340;&#12290;&#22240;&#20026;JTA&#35268;&#33539;&#30340;&#19968;&#20010;&#24456;&#24858;&#34850;&#30340;&#38480;&#21046;&#65292;Hibernate&#19981;&#21487;&#33021;&#33258;&#21160;&#28165;&#29702;&#20219;&#20309;&#26410;&#20851;&#38381;&#30340;<TT 
class=literal>ScrollableResults</TT> &#25110;&#32773;<TT class=literal>Iterator</TT>&#65292;&#23427;&#20204;&#26159;&#30001;<TT 
class=literal>scroll()</TT>&#25110;<TT class=literal>iterate()</TT>&#20135;&#29983;&#30340;&#12290;&#20320;<SPAN 
class=emphasis><EM>must</EM></SPAN>&#36890;&#36807;&#22312;<TT class=literal>finally</TT>&#22359;&#20013;&#65292;&#26174;&#24335;&#35843;&#29992;<TT 
class=literal>ScrollableResults.close()</TT>&#25110;&#32773;<TT 
class=literal>Hibernate.close(Iterator)</TT>&#26041;&#27861;&#26469;&#37322;&#25918;&#24213;&#23618;&#25968;&#25454;&#24211;&#28216;&#26631;&#12290;(&#24403;&#28982;&#65292;&#22823;&#37096;&#20998;&#31243;&#24207;&#23436;&#20840;&#21487;&#20197;&#24456;&#23481;&#26131;&#30340;&#36991;&#20813;&#22312;JTA&#25110;CMT&#20195;&#30721;&#20013;&#20986;&#29616;<TT 
class=literal>scroll()</TT>&#25110;<TT class=literal>iterate()</TT>&#12290;) </P></DIV>
<DIV lang=zh-cn class=sect2>
<DIV class=titlepage>
<DIV>
<DIV>
<H3 class=title><A 
name=transactions-demarcation-exceptions></A>11.2.3.&nbsp;&#24322;&#24120;&#22788;&#29702;</H3></DIV></DIV>
<DIV></DIV></DIV>
<P>&#22914;&#26524; <TT class=literal>Session</TT> &#25243;&#20986;&#24322;&#24120; (&#21253;&#25324;&#20219;&#20309;<TT 
class=literal>SQLException</TT>), &#20320;&#24212;&#35813;&#31435;&#21363;&#22238;&#28378;&#25968;&#25454;&#24211;&#20107;&#21153;&#65292;&#35843;&#29992; <TT 
class=literal>Session.close()</TT> &#65292;&#20002;&#24323;&#35813; <TT class=literal>Session</TT>&#23454;&#20363;&#12290;<TT 
class=literal>Session</TT>&#30340;&#26576;&#20123;&#26041;&#27861;&#21487;&#33021;&#20250;&#23548;&#33268;session 
&#22788;&#20110;&#19981;&#19968;&#33268;&#30340;&#29366;&#24577;&#12290;&#25152;&#26377;&#30001;Hibernate&#25243;&#20986;&#30340;&#24322;&#24120;&#37117;&#35270;&#20026;&#19981;&#21487;&#20197;&#24674;&#22797;&#30340;&#12290;&#30830;&#20445;&#22312; <TT class=literal>finally</TT> &#20195;&#30721;&#22359;&#20013;&#35843;&#29992;<TT 
class=literal>close()</TT>&#26041;&#27861;&#65292;&#20197;&#20851;&#38381;&#25481; <TT class=literal>Session</TT>&#12290; </P>
<P><TT class=literal>HibernateException</TT>&#26159;&#19968;&#20010;&#38750;&#26816;&#26597;&#26399;&#24322;&#24120;&#65288;&#36825;&#19981;&#21516;&#20110;Hibernate&#32769;&#30340;&#29256;&#26412;&#65289;&#65292; 
&#23427;&#23553;&#35013;&#20102;Hibernate&#25345;&#20037;&#23618;&#21487;&#33021;&#20986;&#29616;&#30340;&#22823;&#22810;&#25968;&#38169;&#35823;&#12290;&#25105;&#20204;&#30340;&#35266;&#28857;&#26159;&#65292;&#19981;&#24212;&#35813;&#24378;&#36843;&#24212;&#29992;&#31243;&#24207;&#24320;&#21457;&#20154;&#21592; 
&#22312;&#24213;&#23618;&#25429;&#33719;&#26080;&#27861;&#24674;&#22797;&#30340;&#24322;&#24120;&#12290;&#22312;&#22823;&#22810;&#25968;&#36719;&#20214;&#31995;&#32479;&#20013;&#65292;&#38750;&#26816;&#26597;&#26399;&#24322;&#24120;&#21644;&#33268;&#21629;&#24322;&#24120;&#37117;&#26159;&#22312;&#30456;&#24212;&#26041;&#27861;&#35843;&#29992; 
&#30340;&#22534;&#26632;&#30340;&#39030;&#23618;&#34987;&#22788;&#29702;&#30340;&#65288;&#20063;&#23601;&#26159;&#35828;&#65292;&#22312;&#36719;&#20214;&#19978;&#38754;&#30340;&#36923;&#36753;&#23618;&#65289;&#65292;&#24182;&#19988;&#25552;&#20379;&#19968;&#20010;&#38169;&#35823;&#20449;&#24687;&#32473;&#24212;&#29992;&#36719;&#20214;&#30340;&#29992;&#25143; 
&#65288;&#25110;&#32773;&#37319;&#21462;&#20854;&#20182;&#26576;&#20123;&#30456;&#24212;&#30340;&#25805;&#20316;&#65289;&#12290;&#35831;&#27880;&#24847;&#65292;Hibernate&#20063;&#26377;&#21487;&#33021;&#25243;&#20986;&#20854;&#20182;&#24182;&#19981;&#23646;&#20110; <TT 
class=literal>HibernateException</TT>&#30340;&#38750;&#26816;&#26597;&#26399;&#24322;&#24120;&#12290;&#36825;&#20123;&#24322;&#24120;&#21516;&#26679;&#20063;&#26159;&#26080;&#27861;&#24674;&#22797;&#30340;&#65292;&#24212;&#35813; &#37319;&#21462;&#26576;&#20123;&#30456;&#24212;&#30340;&#25805;&#20316;&#21435;&#22788;&#29702;&#12290; </P>
<P>&#22312;&#21644;&#25968;&#25454;&#24211;&#36827;&#34892;&#20132;&#20114;&#26102;&#65292;Hibernate&#25226;&#25429;&#33719;&#30340;<TT class=literal>SQLException</TT>&#23553;&#35013;&#20026;Hibernate&#30340; <TT 
class=literal>JDBCException</TT>&#12290;&#20107;&#23454;&#19978;&#65292;Hibernate&#23581;&#35797;&#25226;&#24322;&#24120;&#36716;&#25442;&#20026;&#26356;&#26377;&#23454;&#38469;&#21547;&#20041; &#30340;<TT 
class=literal>JDBCException</TT>&#24322;&#24120;&#30340;&#23376;&#31867;&#12290;&#24213;&#23618;&#30340;<TT class=literal>SQLException</TT>&#21487;&#20197; 
&#36890;&#36807;<TT class=literal>JDBCException.getCause()</TT>&#26469;&#24471;&#21040;&#12290;Hibernate&#36890;&#36807;&#20351;&#29992;&#20851;&#32852;&#21040; <TT 
class=literal>SessionFactory</TT>&#19978;&#30340;<TT class=literal>SQLExceptionConverter</TT>&#26469; 
&#25226;<TT class=literal>SQLException</TT>&#36716;&#25442;&#20026;&#19968;&#20010;&#23545;&#24212;&#30340;<TT class=literal>JDBCException</TT> 
&#24322;&#24120;&#30340;&#23376;&#31867;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#65292;<TT class=literal>SQLExceptionConverter</TT>&#21487;&#20197;&#36890;&#36807;&#37197;&#32622;dialect 
&#36873;&#39033;&#25351;&#23450;&#65307;&#27492;&#22806;&#65292;&#20063;&#21487;&#20197;&#20351;&#29992;&#29992;&#25143;&#33258;&#23450;&#20041;&#30340;&#23454;&#29616;&#31867;&#65288;&#21442;&#32771;javadocs <TT 
class=literal>SQLExceptionConverterFactory</TT>&#31867;&#26469;&#20102;&#35299;&#35814;&#24773;&#65289;&#12290;&#26631;&#20934;&#30340; <TT 
class=literal>JDBCException</TT>&#23376;&#31867;&#22411;&#26159;&#65306; </P>
<DIV class=itemizedlist>
<UL type=disc compact>
  <LI>
  <P><TT class=literal>JDBCConnectionException</TT> - &#25351;&#26126;&#24213;&#23618;&#30340;JDBC&#36890;&#35759;&#20986;&#29616;&#38169;&#35823; </P>
  <LI>
  <P><TT class=literal>SQLGrammarException</TT> - &#25351;&#26126;&#21457;&#36865;&#30340;SQL&#35821;&#21477;&#30340;&#35821;&#27861;&#25110;&#32773;&#26684;&#24335;&#38169;&#35823; </P>
  <LI>
  <P><TT class=literal>ConstraintViolationException</TT> - &#25351;&#26126;&#26576;&#31181;&#31867;&#22411;&#30340;&#32422;&#26463;&#36829;&#20363;&#38169;&#35823; </P>
  <LI>
  <P><TT class=literal>LockAcquisitionException</TT> - &#25351;&#26126;&#20102;&#22312;&#25191;&#34892;&#35831;&#27714;&#25805;&#20316;&#26102;&#65292;&#33719;&#21462; 
  &#25152;&#38656;&#30340;&#38145;&#32423;&#21035;&#26102;&#20986;&#29616;&#30340;&#38169;&#35823;&#12290; </P>
  <LI>
  <P><TT class=literal>GenericJDBCException</TT> - &#19981;&#23646;&#20110;&#20219;&#20309;&#20854;&#20182;&#31181;&#31867;&#30340;&#21407;&#29983;&#24322;&#24120; 
</P></LI></UL></DIV></DIV>
<DIV lang=zh-cn class=sect2>
<DIV class=titlepage>
<DIV>
<DIV>
<H3 class=title><A 
name=transactions-demarcation-timeout></A>11.2.4.&nbsp;&#20107;&#21153;&#36229;&#26102;</H3></DIV></DIV>
<DIV></DIV></DIV>
<P>EJB&#36825;&#26679;&#30340;&#25176;&#31649;&#29615;&#22659;&#26377;&#19968;&#39033;&#26497;&#20026;&#37325;&#35201;&#30340;&#29305;&#24615;&#65292;&#32780;&#23427;&#20174;&#26410;&#22312;&#38750;&#25176;&#31649;&#29615;&#22659;&#20013;&#25552;&#20379;&#36807;&#65292;&#37027;&#23601;&#26159;&#20107;&#21153;&#36229;&#26102;&#12290;&#22312;&#20986;&#29616;&#38169;&#35823;&#30340;&#20107;&#21153;&#34892;&#20026;&#30340;&#26102;&#20505;&#65292;&#36229;&#26102;&#21487;&#20197;&#30830;&#20445;&#19981;&#20250;&#26080;&#38480;&#25346;&#36215;&#36164;&#28304;&#12289;&#23545;&#29992;&#25143;&#27809;&#26377;&#20132;&#20195;&#12290;&#22312;&#25176;&#31649;(JTA)&#29615;&#22659;&#20043;&#22806;&#65292;Hibernate&#26080;&#27861;&#23436;&#20840;&#25552;&#20379;&#36825;&#19968;&#21151;&#33021;&#12290;&#20294;&#26159;&#65292;Hiberante&#33267;&#23569;&#21487;&#20197;&#25511;&#21046;&#25968;&#25454;&#35775;&#38382;&#65292;&#30830;&#20445;&#25968;&#25454;&#24211;&#32423;&#21035;&#30340;&#27515;&#38145;&#65292;&#21644;&#36820;&#22238;&#24040;&#22823;&#32467;&#26524;&#38598;&#30340;&#26597;&#35810;&#34987;&#38480;&#23450;&#22312;&#19968;&#20010;&#35268;&#23450;&#30340;&#26102;&#38388;&#20869;&#12290;&#22312;&#25176;&#31649;&#29615;&#22659;&#20013;&#65292;Hibernate&#20250;&#25226;&#20107;&#21153;&#36229;&#26102;&#36716;&#20132;&#32473;JTA&#12290;&#36825;&#19968;&#21151;&#33021;&#36890;&#36807;Hibernate 
<TT class=literal>Transaction</TT>&#23545;&#35937;&#36827;&#34892;&#25277;&#35937;&#12290; </P><PRE class=programlisting>Session sess = factory.openSession();
try {
    //set transaction timeout to 3 seconds
    sess.getTransaction().setTimeout(3);
    sess.getTransaction().begin();

    // do some work
    ...

    sess.getTransaction().commit()
}
catch (RuntimeException e) {
    sess.getTransaction().rollback();
    throw e; // or display error message
}
finally {
    sess.close();
}</PRE>
<P>&#27880;&#24847;<TT class=literal>setTimeout()</TT>&#19981;&#24212;&#35813;&#22312;CMT bean&#20013;&#35843;&#29992;&#65292;&#27492;&#26102;&#20107;&#21153;&#36229;&#26102;&#20540;&#24212;&#35813;&#26159;&#34987;&#22768;&#26126;&#24335;&#23450;&#20041;&#30340;&#12290; 
</P></DIV></DIV>
<DIV lang=zh-cn class=sect1>
<DIV class=titlepage>
<DIV>
<DIV>
<H2 class=title style="CLEAR: both"><A 
name=transactions-optimistic></A>11.3.&nbsp;&#20048;&#35266;&#24182;&#21457;&#25511;&#21046;(Optimistic concurrency 
control)</H2></DIV></DIV>
<DIV></DIV></DIV>
<P>&#21807;&#19968;&#33021;&#22815;&#21516;&#26102;&#20445;&#25345;&#39640;&#24182;&#21457;&#21644;&#39640;&#21487;&#20280;&#32553;&#24615;&#30340;&#26041;&#27861;&#23601;&#26159;&#20351;&#29992;&#24102;&#29256;&#26412;&#21270;&#30340;&#20048;&#35266;&#24182;&#21457;&#25511;&#21046;&#12290;&#29256;&#26412;&#26816;&#26597;&#20351;&#29992;&#29256;&#26412;&#21495;&#12289; 
&#25110;&#32773;&#26102;&#38388;&#25139;&#26469;&#26816;&#27979;&#26356;&#26032;&#20914;&#31361;&#65288;&#24182;&#19988;&#38450;&#27490;&#26356;&#26032;&#20002;&#22833;&#65289;&#12290;Hibernate&#20026;&#20351;&#29992;&#20048;&#35266;&#24182;&#21457;&#25511;&#21046;&#30340;&#20195;&#30721;&#25552;&#20379;&#20102;&#19977;&#31181;&#21487; 
&#33021;&#30340;&#26041;&#27861;&#65292;&#24212;&#29992;&#31243;&#24207;&#22312;&#32534;&#20889;&#36825;&#20123;&#20195;&#30721;&#26102;&#65292;&#21487;&#20197;&#37319;&#29992;&#23427;&#20204;&#12290;&#25105;&#20204;&#24050;&#32463;&#22312;&#21069;&#38754;&#24212;&#29992;&#31243;&#24207;&#23545;&#35805;&#37027;&#37096;&#20998;&#23637;&#31034;&#20102; 
&#20048;&#35266;&#24182;&#21457;&#25511;&#21046;&#30340;&#24212;&#29992;&#22330;&#26223;&#65292;&#27492;&#22806;&#65292;&#22312;&#21333;&#20010;&#25968;&#25454;&#24211;&#20107;&#21153;&#33539;&#22260;&#20869;&#65292;&#29256;&#26412;&#26816;&#26597;&#20063;&#25552;&#20379;&#20102;&#38450;&#27490;&#26356;&#26032;&#20002;&#22833;&#30340;&#22909;&#22788;&#12290; </P>
<DIV lang=zh-cn class=sect2>
<DIV class=titlepage>
<DIV>
<DIV>
<H3 class=title><A 
name=transactions-optimistic-manual></A>11.3.1.&nbsp;&#24212;&#29992;&#31243;&#24207;&#32423;&#21035;&#30340;&#29256;&#26412;&#26816;&#26597;(Application 
version checking)</H3></DIV></DIV>
<DIV></DIV></DIV>
<P>&#26410;&#33021;&#20805;&#20998;&#21033;&#29992;Hibernate&#21151;&#33021;&#30340;&#23454;&#29616;&#20195;&#30721;&#20013;&#65292;&#27599;&#27425;&#21644;&#25968;&#25454;&#24211;&#20132;&#20114;&#37117;&#38656;&#35201;&#19968;&#20010;&#26032;&#30340; <TT 
class=literal>Session</TT>&#65292;&#32780;&#19988;&#24320;&#21457;&#20154;&#21592;&#24517;&#39035;&#22312;&#26174;&#31034;&#25968;&#25454;&#20043;&#21069;&#20174;&#25968;&#25454;&#24211;&#20013;&#37325; 
&#26032;&#36733;&#20837;&#25152;&#26377;&#30340;&#25345;&#20037;&#21270;&#23545;&#35937;&#23454;&#20363;&#12290;&#36825;&#31181;&#26041;&#24335;&#36843;&#20351;&#24212;&#29992;&#31243;&#24207;&#33258;&#24049;&#23454;&#29616;&#29256;&#26412;&#26816;&#26597;&#26469;&#30830;&#20445; &#23545;&#35805;&#20107;&#21153;&#30340;&#38548;&#31163;&#65292;&#20174;&#25968;&#25454;&#35775;&#38382;&#30340;&#35282;&#24230;&#26469;&#35828;&#26159;&#26368;&#20302;&#25928;&#30340;&#12290;&#36825;&#31181;&#20351;&#29992;&#26041;&#24335;&#21644; entity 
EJB&#26368;&#30456;&#20284;&#12290; </P><PRE class=programlisting>// foo is an instance loaded by a previous Session
session = factory.openSession();
Transaction t = session.beginTransaction();

int oldVersion = foo.getVersion();
session.load( foo, foo.getKey() ); // load the current state
if ( oldVersion!=foo.getVersion ) throw new StaleObjectStateException();
foo.setProperty("bar");

t.commit();
session.close();</PRE>
<P><TT class=literal>version</TT> &#23646;&#24615;&#20351;&#29992; <TT 
class=literal>&lt;version&gt;</TT>&#26469;&#26144;&#23556;&#65292;&#22914;&#26524;&#23545;&#35937; &#26159;&#33039;&#25968;&#25454;&#65292;&#22312;&#21516;&#27493;&#30340;&#26102;&#20505;&#65292;Hibernate&#20250;&#33258;&#21160;&#22686;&#21152;&#29256;&#26412;&#21495;&#12290; </P>
<P>&#24403;&#28982;&#65292;&#22914;&#26524;&#20320;&#30340;&#24212;&#29992;&#26159;&#22312;&#19968;&#20010;&#20302;&#25968;&#25454;&#24182;&#21457;&#29615;&#22659;&#19979;&#65292;&#24182;&#19981;&#38656;&#35201;&#29256;&#26412;&#26816;&#26597;&#30340;&#35805;&#65292;&#20320;&#29031;&#26679;&#21487;&#20197;&#20351;&#29992; &#36825;&#31181;&#26041;&#24335;&#65292;&#21482;&#19981;&#36807;&#36339;&#36807;&#29256;&#26412;&#26816;&#26597;&#23601;&#26159;&#20102;&#12290;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;<SPAN 
class=emphasis><EM>&#26368;&#26202;&#25552;&#20132;&#29983;&#25928;</EM></SPAN> &#65288;<SPAN class=emphasis><EM>last commit 
wins</EM></SPAN>&#65289;&#23601;&#26159;&#20320;&#30340;&#38271;&#23545;&#35805;&#30340;&#40664;&#35748;&#22788;&#29702;&#31574;&#30053;&#12290; &#35831;&#35760;&#20303;&#36825;&#31181;&#31574;&#30053;&#21487;&#33021;&#20250;&#35753;&#24212;&#29992;&#36719;&#20214;&#30340;&#29992;&#25143;&#24863;&#21040;&#22256;&#24785;&#65292;&#22240;&#20026;&#20182;&#20204;&#26377;&#21487;&#33021;&#20250;&#30896;&#19978;&#26356;&#26032;&#20002;&#22833;&#25481;&#21364;&#27809; 
&#26377;&#20986;&#38169;&#20449;&#24687;&#65292;&#25110;&#32773;&#38656;&#35201;&#21512;&#24182;&#26356;&#25913;&#20914;&#31361;&#30340;&#24773;&#20917;&#12290; </P>
<P>&#24456;&#26126;&#26174;&#65292;&#25163;&#24037;&#36827;&#34892;&#29256;&#26412;&#26816;&#26597;&#21482;&#36866;&#21512;&#20110;&#26576;&#20123;&#36719;&#20214;&#35268;&#27169;&#38750;&#24120;&#23567;&#30340;&#24212;&#29992;&#22330;&#26223;&#65292;&#23545;&#20110;&#22823;&#22810;&#25968;&#36719;&#20214;&#24212;&#29992;&#22330;&#26223; 
&#26469;&#35828;&#24182;&#19981;&#29616;&#23454;&#12290;&#36890;&#24120;&#24773;&#20917;&#19979;&#65292;&#19981;&#20165;&#26159;&#21333;&#20010;&#23545;&#35937;&#23454;&#20363;&#38656;&#35201;&#36827;&#34892;&#29256;&#26412;&#26816;&#26597;&#65292;&#25972;&#20010;&#34987;&#20462;&#25913;&#36807;&#30340;&#20851; &#32852;&#23545;&#35937;&#22270;&#20063;&#37117;&#38656;&#35201;&#36827;&#34892;&#29256;&#26412;&#26816;&#26597;&#12290;&#20316;&#20026;&#26631;&#20934;&#35774;&#35745;&#33539;&#20363;&#65292;Hibernate&#20351;&#29992;&#25193;&#23637;&#21608;&#26399;&#30340; 
<TT class=literal>Session</TT>&#30340;&#26041;&#24335;&#65292;&#25110;&#32773;&#33073;&#31649;&#23545;&#35937;&#23454;&#20363;&#30340;&#26041;&#24335;&#26469;&#25552;&#20379;&#33258;&#21160;&#29256;&#26412;&#26816;&#26597;&#12290; </P></DIV>
<DIV lang=zh-cn class=sect2>
<DIV class=titlepage>
<DIV>
<DIV>
<H3 class=title><A 
name=transactions-optimistic-longsession></A>11.3.2.&nbsp;&#25193;&#23637;&#21608;&#26399;&#30340;session&#21644;&#33258;&#21160;&#29256;&#26412;&#21270;</H3></DIV></DIV>
<DIV></DIV></DIV>
<P>&#21333;&#20010; <TT class=literal>Session</TT>&#23454;&#20363;&#21644;&#23427;&#25152;&#20851;&#32852;&#30340;&#25152;&#26377;&#25345;&#20037;&#21270;&#23545;&#35937;&#23454;&#20363;&#37117;&#34987;&#29992;&#20110;&#25972;&#20010; &#23545;&#35805;&#65292;&#36825;&#34987;&#31216;&#20026;<SPAN 
class=emphasis><EM>session-per-conversation</EM></SPAN>&#12290;Hibernate&#22312;&#21516;&#27493;&#30340;&#26102;&#20505;&#36827;&#34892;&#23545;&#35937;&#23454;&#20363;&#30340;&#29256;&#26412;&#26816;&#26597;&#65292;&#22914;&#26524;&#26816;&#27979;&#21040;&#24182;&#21457;&#20462; 
&#25913;&#21017;&#25243;&#20986;&#24322;&#24120;&#12290;&#30001;&#24320;&#21457;&#20154;&#21592;&#26469;&#20915;&#23450;&#26159;&#21542;&#38656;&#35201;&#25429;&#33719;&#21644;&#22788;&#29702;&#36825;&#20010;&#24322;&#24120;&#65288;&#36890;&#24120;&#30340;&#25225;&#25321;&#26159;&#32473;&#29992;&#25143; &#25552;&#20379;&#19968;&#20010;&#21512;&#24182;&#26356;&#25913;&#65292;&#25110;&#32773;&#22312;&#26080;&#33039;&#25968;&#25454;&#24773;&#20917;&#19979;&#37325;&#26032;&#36827;&#34892;&#19994;&#21153;&#23545;&#35805;&#30340;&#26426;&#20250;&#65289;&#12290; </P>
<P>&#22312;&#31561;&#24453;&#29992;&#25143;&#20132;&#20114;&#30340;&#26102;&#20505;&#65292; <TT class=literal>Session</TT> &#26029;&#24320;&#24213;&#23618;&#30340;JDBC&#36830;&#25509;&#12290;&#36825;&#31181;&#26041;&#24335; 
&#20197;&#25968;&#25454;&#24211;&#35775;&#38382;&#30340;&#35282;&#24230;&#26469;&#35828;&#26159;&#26368;&#39640;&#25928;&#30340;&#26041;&#24335;&#12290;&#24212;&#29992;&#31243;&#24207;&#19981;&#38656;&#35201;&#20851;&#24515;&#29256;&#26412;&#26816;&#26597;&#25110;&#33073;&#31649;&#23545;&#35937;&#23454;&#20363; &#30340;&#37325;&#26032;&#20851;&#32852;&#65292;&#22312;&#27599;&#20010;&#25968;&#25454;&#24211;&#20107;&#21153;&#20013;&#65292;&#24212;&#29992;&#31243;&#24207;&#20063;&#19981;&#38656;&#35201;&#36733;&#20837;&#35835;&#21462;&#23545;&#35937;&#23454;&#20363;&#12290; </P><PRE class=programlisting>// foo is an instance loaded earlier by the old session
Transaction t = session.beginTransaction(); // Obtain a new JDBC connection, start transaction

foo.setProperty("bar");

session.flush();    // Only for last transaction in conversation
t.commit();         // Also return JDBC connection
session.close();    // Only for last transaction in conversation</PRE>
<P><TT class=literal>foo</TT>&#23545;&#35937;&#30693;&#36947;&#23427;&#26159;&#22312;&#21738;&#20010;<TT 
class=literal>Session</TT>&#20013;&#34987;&#35013;&#20837;&#30340;&#12290;&#22312;&#19968;&#20010;&#26087;session&#20013;&#24320;&#21551;&#19968;&#20010;&#26032;&#30340;&#25968;&#25454;&#24211;&#20107;&#21153;&#65292;&#20250;&#23548;&#33268;session&#33719;&#21462;&#19968;&#20010;&#26032;&#30340;&#36830;&#25509;&#65292;&#24182;&#24674;&#22797;session&#30340;&#21151;&#33021;&#12290;&#23558;&#25968;&#25454;&#24211;&#20107;&#21153;&#25552;&#20132;&#65292;&#20351;&#24471;session&#20174;JDBC&#36830;&#25509;&#26029;&#24320;&#65292;&#24182;&#23558;&#27492;&#36830;&#25509;&#20132;&#36824;&#32473;&#36830;&#25509;&#27744;&#12290;&#22312;&#37325;&#26032;&#36830;&#25509;&#20043;&#21518;&#65292;&#35201;&#24378;&#21046;&#23545;&#20320;&#27809;&#26377;&#26356;&#26032;&#30340;&#25968;&#25454;&#36827;&#34892;&#19968;&#27425;&#29256;&#26412;&#26816;&#26597;&#65292;&#20320;&#21487;&#20197;&#23545;&#25152;&#26377;&#21487;&#33021;&#34987;&#20854;&#20182;&#20107;&#21153;&#20462;&#25913;&#36807;&#30340;&#23545;&#35937;&#65292;&#20351;&#29992;&#21442;&#25968;<TT 
class=literal>LockMode.READ</TT>&#26469;&#35843;&#29992;<TT 
class=literal>Session.lock()</TT>&#12290;&#20320;&#19981;&#29992;lock&#20219;&#20309;&#20320;<SPAN 
class=emphasis><EM>&#27491;&#22312;</EM></SPAN>&#26356;&#26032;&#30340;&#25968;&#25454;&#12290;&#19968;&#33324;&#20320;&#20250;&#22312;&#25193;&#23637;&#30340;<TT 
class=literal>Session</TT>&#19978;&#35774;&#32622;<TT 
class=literal>FlushMode.NEVER</TT>&#65292;&#22240;&#27492;&#21482;&#26377;&#26368;&#21518;&#19968;&#20010;&#25968;&#25454;&#24211;&#20107;&#21153;&#24490;&#29615;&#25165;&#20250;&#30495;&#27491;&#30340;&#21543;&#25972;&#20010;&#23545;&#35805;&#20013;&#21457;&#29983;&#30340;&#20462;&#25913;&#21457;&#36865;&#21040;&#25968;&#25454;&#24211;&#12290;&#22240;&#27492;&#65292;&#21482;&#26377;&#36825;&#26368;&#21518;&#19968;&#27425;&#25968;&#25454;&#24211;&#20107;&#21153;&#25165;&#20250;&#21253;&#21547;<TT 
class=literal>flush()</TT>&#25805;&#20316;&#65292;&#28982;&#21518;&#22312;&#25972;&#20010;&#23545;&#35805;&#32467;&#26463;&#21518;&#65292;&#36824;&#35201;<TT 
class=literal>close()</TT>&#36825;&#20010;session&#12290; </P>
<P>&#22914;&#26524;&#22312;&#29992;&#25143;&#24605;&#32771;&#30340;&#36807;&#31243;&#20013;&#65292;<TT class=literal>Session</TT>&#22240;&#20026;&#22826;&#22823;&#20102;&#32780;&#19981;&#33021;&#20445;&#23384;&#65292;&#37027;&#20040;&#36825;&#31181;&#27169;&#24335;&#26159;&#26377; &#38382;&#39064;&#30340;&#12290;&#20030;&#20363;&#26469;&#35828;&#65292;&#19968;&#20010;<TT 
class=literal>HttpSession</TT>&#24212;&#35813;&#23613;&#21487;&#33021;&#30340;&#23567;&#12290;&#30001;&#20110; <TT 
class=literal>Session</TT>&#26159;&#19968;&#32423;&#32531;&#23384;&#65292;&#24182;&#19988;&#20445;&#25345;&#20102;&#25152;&#26377;&#34987;&#36733;&#20837;&#36807;&#30340;&#23545;&#35937;&#65292;&#22240;&#27492; 
&#25105;&#20204;&#21482;&#24212;&#35813;&#22312;&#37027;&#20123;&#23569;&#37327;&#30340;request/response&#24773;&#20917;&#19979;&#20351;&#29992;&#36825;&#31181;&#31574;&#30053;&#12290;&#20320;&#24212;&#35813;&#21482;&#25226;&#19968;&#20010;<TT 
class=literal>Session</TT>&#29992;&#20110;&#21333;&#20010;&#23545;&#35805;&#65292;&#22240;&#20026;&#23427;&#24456;&#24555;&#23601;&#20250;&#20986;&#29616;&#33039;&#25968;&#25454;&#12290; </P>
<P>&#65288;&#27880;&#24847;&#65292;&#26089;&#26399;&#30340;Hibernate&#29256;&#26412;&#38656;&#35201;&#26126;&#30830;&#30340;&#23545;<TT 
class=literal>Session</TT>&#36827;&#34892;disconnec&#21644;reconnect&#12290;&#36825;&#20123;&#26041;&#27861;&#29616;&#22312;&#24050;&#32463;&#36807;&#26102;&#20102;&#65292;&#25171;&#24320;&#20107;&#21153;&#21644;&#20851;&#38381;&#20107;&#21153;&#20250;&#36215;&#21040;&#21516;&#26679;&#30340;&#25928;&#26524;&#12290;&#65289; 
</P>
<P>&#27492;&#22806;&#65292;&#20063;&#35831;&#27880;&#24847;&#65292;&#20320;&#24212;&#35813;&#35753;&#19982;&#25968;&#25454;&#24211;&#36830;&#25509;&#26029;&#24320;&#30340;<TT class=literal>Session</TT>&#23545;&#25345;&#20037;&#23618;&#20445;&#25345; 
&#20851;&#38381;&#29366;&#24577;&#12290;&#25442;&#21477;&#35805;&#35828;&#65292;&#22312;&#19977;&#23618;&#29615;&#22659;&#20013;&#65292;&#20351;&#29992;&#26377;&#29366;&#24577;&#30340;EJB session bean&#26469;&#25345;&#26377;<TT class=literal>Session</TT>&#65292; 
&#32780;&#19981;&#35201;&#25226;&#23427;&#20256;&#36882;&#21040;web&#23618;&#65288;&#29978;&#33267;&#25226;&#23427;&#24207;&#21015;&#21270;&#21040;&#19968;&#20010;&#21333;&#29420;&#30340;&#23618;&#65289;&#65292;&#20445;&#23384;&#22312;<TT class=literal>HttpSession</TT>&#20013;&#12290; </P>
<P>&#25193;&#23637;session&#27169;&#24335;&#65292;&#25110;&#32773;&#34987;&#31216;&#20026;<SPAN 
class=emphasis><EM>&#27599;&#27425;&#23545;&#35805;&#19968;&#20010;session(session-per-conversation)</EM></SPAN>, 
&#22312;&#19982;&#33258;&#21160;&#31649;&#29702;&#24403;&#21069;session&#19978;&#19979;&#25991;&#32852;&#29992;&#30340;&#26102;&#20505;&#20250;&#26356;&#22256;&#38590;&#12290;&#20320;&#38656;&#35201;&#25552;&#20379;&#20320;&#33258;&#24049;&#30340;<TT 
class=literal>CurrentSessionContext</TT>&#23454;&#29616;&#12290;&#35831;&#21442;&#38405;Hibernate Wiki&#20197;&#33719;&#24471;&#31034;&#20363;&#12290; </P></DIV>
<DIV lang=zh-cn class=sect2>
<DIV class=titlepage>
<DIV>
<DIV>
<H3 class=title><A 
name=transactions-optimistic-detached></A>11.3.3.&nbsp;&#33073;&#31649;&#23545;&#35937;(deatched 
object)&#21644;&#33258;&#21160;&#29256;&#26412;&#21270;</H3></DIV></DIV>
<DIV></DIV></DIV>
<P>&#36825;&#31181;&#26041;&#24335;&#19979;&#65292;&#19982;&#25345;&#20037;&#21270;&#23384;&#20648;&#30340;&#27599;&#27425;&#20132;&#20114;&#37117;&#21457;&#29983;&#22312;&#19968;&#20010;&#26032;&#30340;<TT class=literal>Session</TT>&#20013;&#12290; 
&#28982;&#32780;&#65292;&#21516;&#19968;&#25345;&#20037;&#21270;&#23545;&#35937;&#23454;&#20363;&#21487;&#20197;&#22312;&#22810;&#27425;&#19982;&#25968;&#25454;&#24211;&#30340;&#20132;&#20114;&#20013;&#37325;&#29992;&#12290;&#24212;&#29992;&#31243;&#24207;&#25805;&#32437;&#33073;&#31649;&#23545;&#35937;&#23454;&#20363; &#30340;&#29366;&#24577;&#65292;&#36825;&#20010;&#33073;&#31649;&#23545;&#35937;&#23454;&#20363;&#26368;&#21021;&#26159;&#22312;&#21478;&#19968;&#20010;<TT 
class=literal>Session</TT> &#20013;&#36733;&#20837;&#30340;&#65292;&#28982;&#21518; &#35843;&#29992; <TT 
class=literal>Session.update()</TT>&#65292;<TT 
class=literal>Session.saveOrUpdate()</TT>, &#25110;&#32773; <TT 
class=literal>Session.merge()</TT> &#26469;&#37325;&#26032;&#20851;&#32852;&#35813;&#23545;&#35937;&#23454;&#20363;&#12290; </P><PRE class=programlisting>// foo is an instance loaded by a previous Session
foo.setProperty("bar");
session = factory.openSession();
Transaction t = session.beginTransaction();
session.saveOrUpdate(foo); // Use merge() if "foo" might have been loaded already
t.commit();
session.close();</PRE>
<P>Hibernate&#20250;&#20877;&#19968;&#27425;&#22312;&#21516;&#27493;&#30340;&#26102;&#20505;&#26816;&#26597;&#23545;&#35937;&#23454;&#20363;&#30340;&#29256;&#26412;&#65292;&#22914;&#26524;&#21457;&#29983;&#26356;&#26032;&#20914;&#31361;&#65292;&#23601;&#25243;&#20986;&#24322;&#24120;&#12290; </P>
<P>&#22914;&#26524;&#20320;&#30830;&#20449;&#23545;&#35937;&#27809;&#26377;&#34987;&#20462;&#25913;&#36807;&#65292;&#20320;&#20063;&#21487;&#20197;&#35843;&#29992;<TT class=literal>lock()</TT> &#26469;&#35774;&#32622; <TT 
class=literal>LockMode.READ</TT>&#65288;&#32469;&#36807;&#25152;&#26377;&#30340;&#32531;&#23384;&#65292;&#25191;&#34892;&#29256;&#26412;&#26816;&#26597;&#65289;&#65292;&#20174;&#32780;&#21462; &#20195; <TT 
class=literal>update()</TT>&#25805;&#20316;&#12290; </P></DIV>
<DIV lang=zh-cn class=sect2>
<DIV class=titlepage>
<DIV>
<DIV>
<H3 class=title><A 
name=transactions-optimistic-customizing></A>11.3.4.&nbsp;&#23450;&#21046;&#33258;&#21160;&#29256;&#26412;&#21270;&#34892;&#20026;</H3></DIV></DIV>
<DIV></DIV></DIV>
<P>&#23545;&#20110;&#29305;&#23450;&#30340;&#23646;&#24615;&#21644;&#38598;&#21512;&#65292;&#36890;&#36807;&#20026;&#23427;&#20204;&#35774;&#32622;&#26144;&#23556;&#23646;&#24615;<TT class=literal>optimistic-lock</TT>&#30340;&#20540; &#20026;<TT 
class=literal>false</TT>&#65292;&#26469;&#31105;&#27490;Hibernate&#30340;&#29256;&#26412;&#33258;&#21160;&#22686;&#21152;&#12290;&#36825;&#26679;&#30340;&#35805;&#65292;&#22914;&#26524;&#35813;&#23646;&#24615; &#33039;&#25968;&#25454;&#65292;Hibernate&#23558;&#19981;&#20877;&#22686;&#21152;&#29256;&#26412;&#21495;&#12290; 
</P>
<P>&#36951;&#30041;&#31995;&#32479;&#30340;&#25968;&#25454;&#24211;Schema&#36890;&#24120;&#26159;&#38745;&#24577;&#30340;&#65292;&#19981;&#21487;&#20462;&#25913;&#30340;&#12290;&#25110;&#32773;&#65292;&#20854;&#20182;&#24212;&#29992;&#31243;&#24207;&#20063;&#21487;&#33021;&#35775;&#38382;&#21516;&#19968;&#25968;&#25454; 
&#24211;&#65292;&#26681;&#26412;&#26080;&#27861;&#24471;&#30693;&#22914;&#20309;&#22788;&#29702;&#29256;&#26412;&#21495;&#65292;&#29978;&#33267;&#26102;&#38388;&#25139;&#12290;&#22312;&#20197;&#19978;&#30340;&#25152;&#26377;&#22330;&#26223;&#20013;&#65292;&#23454;&#29616;&#29256;&#26412;&#21270;&#19981;&#33021;&#20381;&#38752; &#25968;&#25454;&#24211;&#34920;&#30340;&#26576;&#20010;&#29305;&#23450;&#21015;&#12290;&#22312;<TT 
class=literal>&lt;class&gt;</TT>&#30340;&#26144;&#23556;&#20013;&#35774;&#32622; <TT 
class=literal>optimistic-lock="all"</TT>&#21487;&#20197;&#22312;&#27809;&#26377;&#29256;&#26412;&#25110;&#32773;&#26102;&#38388;&#25139;&#23646;&#24615;&#26144;&#23556;&#30340;&#24773;&#20917;&#19979;&#23454;&#29616; 
&#29256;&#26412;&#26816;&#26597;&#65292;&#27492;&#26102;Hibernate&#23558;&#27604;&#36739;&#19968;&#34892;&#35760;&#24405;&#30340;&#27599;&#20010;&#23383;&#27573;&#30340;&#29366;&#24577;&#12290;&#35831;&#27880;&#24847;&#65292;&#21482;&#26377;&#24403;Hibernate&#33021;&#22815;&#27604; &#36739;&#26032;&#26087;&#29366;&#24577;&#30340;&#24773;&#20917;&#19979;&#65292;&#36825;&#31181;&#26041;&#24335;&#25165;&#33021;&#29983;&#25928;&#65292;&#20063;&#23601;&#26159;&#35828;&#65292; 
&#20320;&#24517;&#39035;&#20351;&#29992;&#21333;&#20010;&#38271;&#29983;&#21629;&#21608;&#26399;<TT class=literal>Session</TT>&#27169;&#24335;&#65292;&#32780;&#19981;&#33021;&#20351;&#29992; 
session-per-request-with-detached-objects&#27169;&#24335;&#12290; </P>
<P>&#26377;&#20123;&#24773;&#20917;&#19979;&#65292;&#21482;&#35201;&#26356;&#25913;&#19981;&#21457;&#29983;&#20132;&#38169;&#65292;&#24182;&#21457;&#20462;&#25913;&#20063;&#26159;&#20801;&#35768;&#30340;&#12290;&#24403;&#20320;&#22312;<TT class=literal>&lt;class&gt;</TT> &#30340;&#26144;&#23556;&#20013;&#35774;&#32622;<TT 
class=literal>optimistic-lock="dirty"</TT>&#65292;Hibernate&#22312;&#21516;&#27493;&#30340;&#26102;&#20505;&#23558;&#21482;&#27604;&#36739;&#26377;&#33039; &#25968;&#25454;&#30340;&#23383;&#27573;&#12290; </P>
<P>&#22312;&#20197;&#19978;&#25152;&#26377;&#22330;&#26223;&#20013;&#65292;&#19981;&#31649;&#26159;&#19987;&#38376;&#35774;&#32622;&#19968;&#20010;&#29256;&#26412;/&#26102;&#38388;&#25139;&#21015;&#65292;&#36824;&#26159;&#36827;&#34892;&#20840;&#37096;&#23383;&#27573;/&#33039;&#25968;&#25454;&#23383;&#27573;&#27604;&#36739;&#65292; Hibernate&#37117;&#20250;&#38024;&#23545;&#27599;&#20010;&#23454;&#20307;&#23545;&#35937;&#21457;&#36865;&#19968;&#26465;<TT 
class=literal>UPDATE</TT>&#65288;&#24102;&#26377;&#30456;&#24212;&#30340; <TT class=literal>WHERE</TT>&#35821;&#21477; 
&#65289;&#30340;SQL&#35821;&#21477;&#26469;&#25191;&#34892;&#29256;&#26412;&#26816;&#26597;&#21644;&#25968;&#25454;&#26356;&#26032;&#12290;&#22914;&#26524;&#20320;&#23545;&#20851;&#32852;&#23454;&#20307; &#35774;&#32622;&#32423;&#32852;&#20851;&#31995;&#20351;&#29992;&#20256;&#25773;&#24615;&#25345;&#20037;&#21270;&#65288;transitive 
persistence&#65289;&#65292;&#37027;&#20040;Hibernate&#21487;&#33021;&#20250;&#25191;&#34892;&#19981;&#24517; &#35201;&#30340;update&#35821;&#21477;&#12290;&#36825;&#36890;&#24120;&#19981;&#26159;&#20010;&#38382;&#39064;&#65292;&#20294;&#26159;&#25968;&#25454;&#24211;&#37324;&#38754;&#23545;<SPAN 
class=emphasis><EM>on update</EM></SPAN>&#28857;&#28779; &#30340;&#35302;&#21457;&#22120;&#21487;&#33021;&#22312;&#33073;&#31649;&#23545;&#35937;&#27809;&#26377;&#20219;&#20309;&#26356;&#25913;&#30340;&#24773;&#20917;&#19979;&#34987;&#35302;&#21457;&#12290;&#22240;&#27492;&#65292;&#20320;&#21487;&#20197;&#22312; <TT 
class=literal>&lt;class&gt;</TT>&#30340;&#26144;&#23556;&#20013;&#65292;&#36890;&#36807;&#35774;&#32622;<TT 
class=literal>select-before-update="true"</TT> &#26469;&#23450;&#21046;&#36825;&#19968;&#34892;&#20026;&#65292;&#24378;&#21046;Hibernate <TT 
class=literal>SELECT</TT>&#36825;&#20010;&#23545;&#35937;&#23454;&#20363;&#65292;&#20174;&#32780;&#20445;&#35777;&#65292; &#22312;&#26356;&#26032;&#35760;&#24405;&#20043;&#21069;&#65292;&#23545;&#35937;&#30340;&#30830;&#26159;&#34987;&#20462;&#25913;&#36807;&#12290; </P></DIV></DIV>
<DIV lang=zh-cn class=sect1>
<DIV class=titlepage>
<DIV>
<DIV>
<H2 class=title style="CLEAR: both"><A 
name=transactions-locking></A>11.4.&nbsp;&#24754;&#35266;&#38145;&#23450;(Pessimistic 
Locking)</H2></DIV></DIV>
<DIV></DIV></DIV>
<P>&#29992;&#25143;&#20854;&#23454;&#24182;&#19981;&#38656;&#35201;&#33457;&#24456;&#22810;&#31934;&#21147;&#21435;&#25285;&#24515;&#38145;&#23450;&#31574;&#30053;&#30340;&#38382;&#39064;&#12290;&#36890;&#24120;&#24773;&#20917;&#19979;&#65292;&#21482;&#35201;&#20026;JDBC&#36830;&#25509;&#25351;&#23450;&#19968;&#19979;&#38548; 
&#31163;&#32423;&#21035;&#65292;&#28982;&#21518;&#35753;&#25968;&#25454;&#24211;&#21435;&#25630;&#23450;&#19968;&#20999;&#23601;&#22815;&#20102;&#12290;&#28982;&#32780;&#65292;&#39640;&#32423;&#29992;&#25143;&#26377;&#26102;&#20505;&#24076;&#26395;&#36827;&#34892;&#19968;&#20010;&#25490;&#23427;&#30340;&#24754;&#35266;&#38145;&#23450;&#65292; &#25110;&#32773;&#22312;&#19968;&#20010;&#26032;&#30340;&#20107;&#21153;&#21551;&#21160;&#30340;&#26102;&#20505;&#65292;&#37325;&#26032;&#36827;&#34892;&#38145;&#23450;&#12290; </P>
<P>Hibernate&#24635;&#26159;&#20351;&#29992;&#25968;&#25454;&#24211;&#30340;&#38145;&#23450;&#26426;&#21046;&#65292;&#20174;&#19981;&#22312;&#20869;&#23384;&#20013;&#38145;&#23450;&#23545;&#35937;&#65281; </P>
<P>&#31867;<TT class=literal>LockMode</TT> &#23450;&#20041;&#20102;Hibernate&#25152;&#38656;&#30340;&#19981;&#21516;&#30340;&#38145;&#23450;&#32423;&#21035;&#12290;&#19968;&#20010;&#38145;&#23450; &#21487;&#20197;&#36890;&#36807;&#20197;&#19979;&#30340;&#26426;&#21046;&#26469;&#35774;&#32622;: 
</P>
<DIV class=itemizedlist>
<UL type=disc compact>
  <LI>
  <P>&#24403;Hibernate&#26356;&#26032;&#25110;&#32773;&#25554;&#20837;&#19968;&#34892;&#35760;&#24405;&#30340;&#26102;&#20505;&#65292;&#38145;&#23450;&#32423;&#21035;&#33258;&#21160;&#35774;&#32622;&#20026;<TT class=literal>LockMode.WRITE</TT>&#12290; 
</P>
  <LI>
  <P>&#24403;&#29992;&#25143;&#26174;&#24335;&#30340;&#20351;&#29992;&#25968;&#25454;&#24211;&#25903;&#25345;&#30340;SQL&#26684;&#24335;<TT class=literal>SELECT ... FOR UPDATE</TT> 
  &#21457;&#36865;SQL&#30340;&#26102;&#20505;&#65292;&#38145;&#23450;&#32423;&#21035;&#35774;&#32622;&#20026;<TT class=literal>LockMode.UPGRADE</TT> </P>
  <LI>
  <P>&#24403;&#29992;&#25143;&#26174;&#24335;&#30340;&#20351;&#29992;Oracle&#25968;&#25454;&#24211;&#30340;SQL&#35821;&#21477;<TT class=literal>SELECT ... FOR UPDATE NOWAIT</TT> 
  &#30340;&#26102;&#20505;&#65292;&#38145;&#23450;&#32423;&#21035;&#35774;&#32622;<TT class=literal>LockMode.UPGRADE_NOWAIT</TT> </P>
  <LI>
  <P>&#24403;Hibernate&#22312;“&#21487;&#37325;&#22797;&#35835;”&#25110;&#32773;&#26159;“&#24207;&#21015;&#21270;”&#25968;&#25454;&#24211;&#38548;&#31163;&#32423;&#21035;&#19979;&#35835;&#21462;&#25968;&#25454;&#30340;&#26102;&#20505;&#65292;&#38145;&#23450;&#27169;&#24335; &#33258;&#21160;&#35774;&#32622;&#20026;<TT 
  class=literal>LockMode.READ</TT>&#12290;&#36825;&#31181;&#27169;&#24335;&#20063;&#21487;&#20197;&#36890;&#36807;&#29992;&#25143;&#26174;&#24335;&#25351;&#23450;&#36827;&#34892;&#35774;&#32622;&#12290; </P>
  <LI>
  <P><TT class=literal>LockMode.NONE</TT> &#20195;&#34920;&#26080;&#38656;&#38145;&#23450;&#12290;&#22312;<TT 
  class=literal>Transaction</TT>&#32467;&#26463;&#26102;&#65292; &#25152;&#26377;&#30340;&#23545;&#35937;&#37117;&#20999;&#25442;&#21040;&#35813;&#27169;&#24335;&#19978;&#26469;&#12290;&#19982;session&#30456;&#20851;&#32852;&#30340;&#23545;&#35937;&#36890;&#36807;&#35843;&#29992;<TT 
  class=literal>update()</TT> &#25110;&#32773;<TT class=literal>saveOrUpdate()</TT>&#33073;&#31163;&#35813;&#27169;&#24335;&#12290; 
  </P></LI></UL></DIV>
<P>"&#26174;&#24335;&#30340;&#29992;&#25143;&#25351;&#23450;"&#21487;&#20197;&#36890;&#36807;&#20197;&#19979;&#20960;&#31181;&#26041;&#24335;&#20043;&#19968;&#26469;&#34920;&#31034;: </P>
<DIV class=itemizedlist>
<UL type=disc compact>
  <LI>
  <P>&#35843;&#29992; <TT class=literal>Session.load()</TT>&#30340;&#26102;&#20505;&#25351;&#23450;<TT 
  class=literal>&#38145;&#23450;&#27169;&#24335;(LockMode)</TT>&#12290; </P>
  <LI>
  <P>&#35843;&#29992;<TT class=literal>Session.lock()</TT>&#12290; </P>
  <LI>
  <P>&#35843;&#29992;<TT class=literal>Query.setLockMode()</TT>&#12290; </P></LI></UL></DIV>
<P>&#22914;&#26524;&#22312;<TT class=literal>UPGRADE</TT>&#25110;&#32773;<TT 
class=literal>UPGRADE_NOWAIT</TT>&#38145;&#23450;&#27169;&#24335;&#19979;&#35843; &#29992;<TT 
class=literal>Session.load()</TT>&#65292;&#24182;&#19988;&#35201;&#35835;&#21462;&#30340;&#23545;&#35937;&#23578;&#26410;&#34987;session&#36733;&#20837;&#36807;&#65292;&#37027;&#20040;&#23545;&#35937; &#36890;&#36807;<TT 
class=literal>SELECT ... FOR UPDATE</TT>&#36825;&#26679;&#30340;SQL&#35821;&#21477;&#34987;&#36733;&#20837;&#12290;&#22914;&#26524;&#20026;&#19968;&#20010;&#23545;&#35937;&#35843;&#29992; <TT 
class=literal>load()</TT>&#26041;&#27861;&#26102;&#65292;&#35813;&#23545;&#35937;&#24050;&#32463;&#22312;&#21478;&#19968;&#20010;&#36739;&#23569;&#38480;&#21046;&#30340;&#38145;&#23450;&#27169;&#24335;&#19979;&#34987;&#36733;&#20837;&#20102;&#65292;&#37027; &#20040;Hibernate&#23601;&#23545;&#35813;&#23545;&#35937;&#35843;&#29992;<TT 
class=literal>lock()</TT> &#26041;&#27861;&#12290; </P>
<P>&#22914;&#26524;&#25351;&#23450;&#30340;&#38145;&#23450;&#27169;&#24335;&#26159;<TT class=literal>READ</TT>, <TT class=literal>UPGRADE</TT> &#25110; <TT 
class=literal>UPGRADE_NOWAIT</TT>&#65292;&#37027;&#20040;<TT class=literal>Session.lock()</TT>&#23601; 
&#25191;&#34892;&#29256;&#26412;&#21495;&#26816;&#26597;&#12290;&#65288;&#22312;<TT class=literal>UPGRADE</TT> &#25110;&#32773;<TT class=literal>UPGRADE_NOWAIT</TT> 
&#38145;&#23450;&#27169;&#24335;&#19979;&#65292;&#25191;&#34892;<TT class=literal>SELECT ... FOR UPDATE</TT>&#36825;&#26679;&#30340;SQL&#35821;&#21477;&#12290;&#65289; </P>
<P>&#22914;&#26524;&#25968;&#25454;&#24211;&#19981;&#25903;&#25345;&#29992;&#25143;&#35774;&#32622;&#30340;&#38145;&#23450;&#27169;&#24335;&#65292;Hibernate&#23558;&#20351;&#29992;&#36866;&#24403;&#30340;&#26367;&#20195;&#27169;&#24335;&#65288;&#32780;&#19981;&#26159;&#25172;&#20986;&#24322;&#24120;&#65289;&#12290; &#36825;&#19968;&#28857;&#21487;&#20197;&#30830;&#20445;&#24212;&#29992;&#31243;&#24207;&#30340;&#21487;&#31227;&#26893;&#24615;&#12290; </P></DIV>
<DIV lang=zh-cn class=sect1>
<DIV class=titlepage>
<DIV>
<DIV>
<H2 class=title style="CLEAR: both"><A 
name=transactions-connection-release></A>11.5.&nbsp;&#36830;&#25509;&#37322;&#25918;&#27169;&#24335;(Connection Release 
Modes)</H2></DIV></DIV>
<DIV></DIV></DIV>
<P>Hibernate&#20851;&#20110;JDBC&#36830;&#25509;&#31649;&#29702;&#30340;&#26087;(2.x)&#34892;&#20026;&#26159;&#65292;<TT 
class=literal>Session</TT>&#22312;&#31532;&#19968;&#27425;&#38656;&#35201;&#30340;&#26102;&#20505;&#33719;&#21462;&#19968;&#20010;&#36830;&#25509;&#65292;&#22312;session&#20851;&#38381;&#20043;&#21069;&#19968;&#30452;&#20250;&#25345;&#26377;&#36825;&#20010;&#36830;&#25509;&#12290;Hibernate&#24341;&#20837;&#20102;&#36830;&#25509;&#37322;&#25918;&#30340;&#27010;&#24565;&#65292;&#26469;&#21578;&#35785;session&#22914;&#20309;&#22788;&#29702;&#23427;&#30340;JDBC&#36830;&#25509;&#12290;&#27880;&#24847;&#65292;&#19979;&#38754;&#30340;&#35752;&#35770;&#21482;&#36866;&#29992;&#20110;&#37319;&#29992;&#37197;&#32622;<TT 
class=literal>ConnectionProvider</TT>&#26469;&#25552;&#20379;&#36830;&#25509;&#30340;&#24773;&#20917;&#65292;&#29992;&#25143;&#33258;&#24049;&#25552;&#20379;&#30340;&#36830;&#25509;&#19982;&#36825;&#37324;&#30340;&#35752;&#35770;&#26080;&#20851;&#12290;&#36890;&#36807;<TT 
class=literal>org.hibernate.ConnectionReleaseMode</TT>&#30340;&#19981;&#21516;&#26522;&#20030;&#20540;&#26469;&#20351;&#29992;&#19981;&#29992;&#30340;&#37322;&#25918;&#27169;&#24335;: </P>
<DIV class=itemizedlist>
<UL type=disc compact>
  <LI>
  <P><TT class=literal>ON_CLOSE</TT> - &#22522;&#26412;&#19978;&#23601;&#26159;&#19978;&#38754;&#25552;&#21040;&#30340;&#32769;&#24335;&#34892;&#20026;&#12290;Hibernate 
  session&#22312;&#31532;&#19968;&#27425;&#38656;&#35201;&#36827;&#34892;JDBC&#25805;&#20316;&#30340;&#26102;&#20505;&#33719;&#21462;&#36830;&#25509;&#65292;&#28982;&#21518;&#25345;&#26377;&#23427;&#65292;&#30452;&#21040;session&#20851;&#38381;&#12290; </P>
  <LI>
  <P><TT class=literal>AFTER_TRANSACTION</TT> - &#22312;<TT 
  class=literal>org.hibernate.Transaction</TT>&#32467;&#26463;&#21518;&#37322;&#25918;&#36830;&#25509;&#12290; </P>
  <LI>
  <P><TT class=literal>AFTER_STATEMENT</TT> (&#20063;&#34987;&#31216;&#20570;&#31215;&#26497;&#37322;&#25918;) - 
  &#22312;&#27599;&#19968;&#26465;&#35821;&#21477;&#34987;&#25191;&#34892;&#21518;&#23601;&#37322;&#25918;&#36830;&#25509;&#12290;&#20294;&#20551;&#33509;&#35821;&#21477;&#30041;&#19979;&#20102;&#19982;session&#30456;&#20851;&#30340;&#36164;&#28304;&#65292;&#37027;&#23601;&#19981;&#20250;&#34987;&#37322;&#25918;&#12290;&#30446;&#21069;&#21807;&#19968;&#30340;&#36825;&#31181;&#24773;&#24418;&#23601;&#26159;&#20351;&#29992;<TT 
  class=literal>org.hibernate.ScrollableResults</TT>&#12290; </P></LI></UL></DIV>
<P><TT 
class=literal>hibernate.connection.release_mode</TT>&#37197;&#32622;&#21442;&#25968;&#29992;&#26469;&#25351;&#23450;&#20351;&#29992;&#21738;&#19968;&#31181;&#37322;&#25918;&#27169;&#24335;&#12290;&#21487;&#33021;&#30340;&#20540;&#26377;&#65306; 
</P>
<DIV class=itemizedlist>
<UL type=disc compact>
  <LI>
  <P><TT class=literal>auto</TT>(&#40664;&#35748;) - &#36825;&#19968;&#36873;&#25321;&#25226;&#37322;&#25918;&#27169;&#24335;&#22996;&#27966;&#32473;<TT 
  class=literal>org.hibernate.transaction.TransactionFactory.getDefaultReleaseMode()</TT>&#26041;&#27861;&#12290;&#23545;JTATransactionFactory&#26469;&#35828;&#65292;&#23427;&#20250;&#36820;&#22238;ConnectionReleaseMode.AFTER_STATEMENT;&#23545;JDBCTransactionFactory&#26469;&#35828;&#65292;&#21017;&#26159;ConnectionReleaseMode.AFTER_TRANSACTION&#12290;&#24456;&#23569;&#38656;&#35201;&#20462;&#25913;&#36825;&#19968;&#40664;&#35748;&#34892;&#20026;&#65292;&#22240;&#20026;&#20551;&#33509;&#35774;&#32622;&#19981;&#24403;&#65292;&#23601;&#20250;&#24102;&#26469;bug&#65292;&#25110;&#32773;&#32473;&#29992;&#25143;&#20195;&#30721;&#24102;&#26469;&#35823;&#23548;&#12290; 
  </P>
  <LI>
  <P><TT class=literal>on_close</TT> - &#20351;&#29992; ConnectionReleaseMode.ON_CLOSE. 
  &#36825;&#31181;&#26041;&#24335;&#26159;&#20026;&#20102;&#21521;&#19979;&#20860;&#23481;&#30340;,&#20294;&#26159;&#24050;&#32463;&#23436;&#20840;&#19981;&#34987;&#40723;&#21169;&#20351;&#29992;&#20102;&#12290; </P>
  <LI>
  <P><TT class=literal>after_transaction</TT> - 
  &#20351;&#29992;ConnectionReleaseMode.AFTER_TRANSACTION&#12290;&#36825;&#19968;&#35774;&#32622;&#19981;&#24212;&#35813;&#22312;JTA&#29615;&#22659;&#19979;&#20351;&#29992;&#12290;&#20063;&#35201;&#27880;&#24847;&#65292;&#20351;&#29992;ConnectionReleaseMode.AFTER_TRANSACTION&#30340;&#26102;&#20505;&#65292;&#20551;&#33509;session 
  &#22788;&#20110;auto-commit&#29366;&#24577;&#65292;&#36830;&#25509;&#20250;&#20687;AFTER_STATEMENT&#37027;&#26679;&#34987;&#37322;&#25918;&#12290; </P>
  <LI>
  <P><TT class=literal>after_statement</TT> - 
  &#20351;&#29992;ConnectionReleaseMode.AFTER_STATEMENT&#12290;&#38500;&#27492;&#20043;&#22806;&#65292;&#20250;&#26597;&#35810;&#37197;&#32622;&#30340;<TT 
  class=literal>ConnectionProvider</TT>&#65292;&#26159;&#21542;&#23427;&#25903;&#25345;&#36825;&#19968;&#35774;&#32622;&#65288;(<TT 
  class=literal>supportsAggressiveRelease()</TT>)&#65289;&#12290;&#20551;&#33509;&#19981;&#25903;&#25345;&#65292;&#37322;&#25918;&#27169;&#24335;&#20250;&#34987;&#35774;&#32622;&#20026;ConnectionReleaseMode.AFTER_TRANSACTION&#12290;&#21482;&#26377;&#22312;&#20320;&#27599;&#27425;&#35843;&#29992;<TT 
  class=literal>ConnectionProvider.getConnection()</TT>&#33719;&#21462;&#24213;&#23618;JDBC&#36830;&#25509;&#30340;&#26102;&#20505;&#65292;&#37117;&#21487;&#20197;&#30830;&#20449;&#33719;&#24471;&#21516;&#19968;&#20010;&#36830;&#25509;&#30340;&#26102;&#20505;&#65292;&#36825;&#19968;&#35774;&#32622;&#25165;&#26159;&#23433;&#20840;&#30340;&#65307;&#25110;&#32773;&#22312;auto-commit&#29615;&#22659;&#20013;&#65292;&#20320;&#21487;&#20197;&#19981;&#31649;&#26159;&#21542;&#27599;&#27425;&#37117;&#33719;&#24471;&#21516;&#19968;&#20010;&#36830;&#25509;&#30340;&#26102;&#20505;&#65292;&#36825;&#25165;&#26159;&#23433;&#20840;&#30340;&#12290; 
  </P></LI></UL></DIV></DIV></DIV>
<DIV class=navfooter>
<HR>

<TABLE width="100%" summary="Navigation footer">
  <TBODY>
  <TR>
    <TD width="40%" align=left><A accessKey=p 
    href="objectstate.html">&#19978;&#19968;&#39029;</A>&nbsp;</TD>
    <TD width="20%" align=center><A accessKey=u href="index.html">&#19978;&#19968;&#32423;</A></TD>
    <TD width="40%" align=right>&nbsp;<A accessKey=n 
    href="events.html">&#19979;&#19968;&#39029;</A></TD></TR>
  <TR>
    <TD vAlign=top width="40%" align=left>&#31532;&nbsp;10&nbsp;&#31456;&nbsp;&#19982;&#23545;&#35937;&#20849;&#20107;&nbsp;</TD>
    <TD width="20%" align=center><A accessKey=h href="index.html">&#36215;&#22987;&#39029;</A></TD>
    <TD vAlign=top width="40%" align=right>&nbsp;&#31532;&nbsp;12&nbsp;&#31456;&nbsp; 
      &#25318;&#25130;&#22120;&#19982;&#20107;&#20214;(Interceptors and events) </TD></TR></TBODY></TABLE></DIV></BODY></HTML>
